[
  {
    "id": "1dzc3zh",
    "title": "All Layover Questions - READ THIS NOTICE",
    "text": "**READ THE NEW LAYOVER FAQ:** [**https://www.reddit.com/r/travel/wiki/mfaq-flying/layovers**](https://www.reddit.com/r/travel/wiki/mfaq-flying/layovers)\n\nAll layover questions will be removed unless your situation is unique and cannot be answered by the wiki.\n\n**Members of the community**: please report any layover questions that can be answered by the wiki and we will remove them promptly.\n\nSelf-transfers times are not covered under this new guideline and wiki.",
    "comments_lev1": [
      "Hallelujah. The only thing I’d add to the FAQ is that, yes, you will rebooked on the next flight if you’re on a single itinerary and miss your original flight",
      "What's your favorite airport restaurant to eat at during a layover?\n\nSbarro?",
      "Yeah but is 18 minutes long enough for me to recheck my bag, go thru security, ride the tram and grab a snack at DFW?",
      "Take out the “*Am I due compensation?*” posts yet, and this sub will be a ghost town.",
      "It might be nice if this also includes what layover situations require you to collect and recheck bags (will airline transfer them automatically?), go through customs (i.e. at first entry in Schengen, US, not necessarily at final destination, etc.), go through security, etc.",
      "Do we report for violating Rule #1?",
      "Good call. I think you should also ban posts where people ask about which of two places ",
      "You should make a thread for layovers so spam doesnt happen. Is it possible if i can ask a layover question here about my trip from OHare to Dublin coming up? I want to respect all rules :)",
      "Thank you! Excellent job done. 🙏🏻",
      "hello, im Indonesia passport holder and will transit in Athens from non-schengen to non-schengen in 1 PNR code, i guess it should be fine but said in Aegean from non-schengen to non-schengen need to go thru immigration. please share with me if anyone had this experience, thank you",
      "How about the:\n\n\"is (insert name of airline) strict about carry-ons\"\n\n\"my bag is 50cm over size. Will I get away with it?\"",
      "I have an Indian passport and I am traveling from India (Delhi) to Chile (Santiago). I have a layover in Finland (Helsinki) and Spain (Madrid) and it is a single ticket. Finland does not require any transit visa but Spain does. But the Spain website is saying that they only give transit visas if Spain is the first layover. What can I do? I'm stuck and my flight is on 5th August.",
      "Hello all, I'm flying JFK to BKK with a 4 hour layover in IST next week. The problem is I just noticed I will have 5.5 months of validity on my passport by date of travel. Will there be an issue with boarding at JFK even though I won't be leaving the transit area and am not going through immigration?",
      "[removed]"
    ],
    "comments_lev2": [
      "Thanks for the feedback, will add that shortly!",
      "This actually happened to me last week.",
      "I'm more of an Auntie Anne's kinda guy. The pretzel is a metaphor.",
      "I went to Chili's at O'hare once time in between 2 overnight flights. \n\nIt slapped like nothing else had slapped before or will ever slap.  I think about that bowl often during my travels",
      "Panda Express or a local chain.",
      "Also, just reminded me of [https://www.youtube.com/watch?v=TRgEeDR98X8](https://www.youtube.com/watch?v=TRgEeDR98X8)",
      "DXB - Paul",
      "Will try that next. We have the giant automod comment listing out all the compensation structures.",
      "I'm personally partial to \"my passport expires in less than six months, is this okay? Oh and also my flight is tomorrow\"",
      "Good call! Will include that information. Thanks.",
      "Absolutely, if you'd like. We try to catch those as often as possible for 'simple questions' but we tend to miss a few occasionally due to the volume of submissions.",
      "We had a layover megathread before. It was not too successful because:\n\na) posters didn't see it pinned - they tend to ignore announcements and rules in the first place\n\nb) the community didn't want to keep going back to the megathread to answer questions\n\n[https://www.reddit.com/r/Flights/comments/150h3vf/megathread\\_will\\_i\\_make\\_my\\_layover\\_do\\_i\\_need\\_a/](https://www.reddit.com/r/Flights/comments/150h3vf/megathread_will_i_make_my_layover_do_i_need_a/)\n\n\n\nFeel free to make a top-level post about your layover if, only after reading the Layover FAQ, your situation is still unclear. Please specify *why* or *what* isn't clear to you from the FAQ, and maybe we can use it to clarify the FAQ better if it really isn't answered well.",
      "Good idea. I can put that in [the usual Flying FAQ](https://www.reddit.com/r/travel/wiki/mfaq-flying/).",
      "But I might! Or, in my case, the person in front of me might. As happened.",
      "You can't transit between two Schengen airports without **an entry visa**.\n\n\nHEL-MAD is basically a domestic flight within the context of the Schengen area. You won't be able to fly without a short-stay Schengen visa.\n\n\nA transit visa won't work. The Schengen transit visa is only for transit at SINGLE Schengen airport like DEL-CDG-SCL but not DEL-HEL-MAD-SCL.\n\n\nChange your flight.",
      "[https://travel.state.gov/content/travel/en/international-travel/International-Travel-Country-Information-Pages/Thailand.html](https://travel.state.gov/content/travel/en/international-travel/International-Travel-Country-Information-Pages/Thailand.html)\n\nAirlines just enforce what each country requires for entry.\n\nYou're not boarding your flight to Thailand next week.\n\nThis is completely independent of your IST layover anyways. The layover is irrelevant.",
      "Make your own top level post."
    ]
  },
  {
    "id": "1gyeei8",
    "title": "Why do people like Las Vegas?",
    "text": "This subreddit notoriously hates Dubai and Disneyland, yet has no issue with folks including Vegas in their itineraries. Yet as an American I've been to Las Vegas once and was ready to leave after about 2 hours (well, maybe add one more hour for the neon museum)--Fremont street lasted me a whole 5 minutes.\n\nSo for those who line up with this subreddit's usual priorities, what's the appeal in Las Vegas? What makes it worth visiting in a way Dubai isn't?",
    "comments_lev1": [
      "If you are a frequent business traveler you can’t escape Vegas. Conferences like to book there because they almost never run out of hotel rooms. The same number of travelers would paralyze most cities.",
      "Vegas gets slammed here *all* the time too. You're not alone.\n\nTo each their own, it's nothing to worry about.\n\nHappy travels.",
      "People who take the time to post on travel forums often pan Vegas for being “inauthentic”\n\nI say that’s complete crap.  \n\nLas Vegas is authentic as it gets.  If you go to Las Vegas expecting a European culturally rich experience you’re going for the wrong reasons.  Nobody at Caesar’s thinks they’re in Ancient Rome.  The city is a playground and ranges from the most opulent Americana can offer to a seedy underworld.  There’s plenty of organized crime folklore that’s romantic in an odd way.  That is its culture.  \n\nThere’s amazing entertainment every single night.  There’s good food from hole in the wall joints off the beaten paths to celebrity chefs.  It’s become a center for sports and being around other fans.  Watching NFL football, or any other sport in Vegas is an amazing experience.  \n\nThere’s something for everyone in Las Vegas.  There’s plenty of great nature not too far from the city.  \n\nPeople need to set realistic expectations of their travels.  Don’t go to Vegas for 3 days and expect it to be the same vacation as an 18 day tour of Southeast Asia.",
      "I can fly to Vegas direct. Watch an f1 race and nfl game within walking distance of nice hotels. Get in, see nice shows, and get out. What's not to like? If I want nature or culture, I'll go elsewhere, but for what it is, it fits.",
      "I love sports and gambling and good food and drinks and people watching and pools and live music",
      "Well for starters I’m not going to get locked up in Vegas for holding my partner’s hand or smoking a joint. \n\nVegas is generally much more tolerant of letting people do whatever they want. Dubai is more known for being a place you can enjoy luxury in a controlled, secure environment. People compare the two because they are tourist destinations in desert climates but they are very different culturally and don’t have much in common other than nice hotels and weather.",
      "I like Vegas since there’s plenty to do and shop. Great shows and it’s beautiful at night. The hotels are appealing and beautifully designed.",
      "Dubai is in a category of its own due to the human rights issues involved.\n\nI also don’t think it’s true that this sub inherently hates Disney - it’s just not how the vast majority of the people here choose to travel.  Going to Disney, if that’s what you like, is no more or less stupid than going to the same foreign city over and over again, if that’s what you like.  Life is too short to worry about other people’s preferences…and most people here know that.  Las Vegas falls into this category as well.  If you like shows, gambling, and cheap buffets, then have at it.",
      "Vegas companies don’t take their workers’ passports and force them to stay. Only go to Dubai if you believe modern day slavery is acceptable",
      "Why am I not surprised someone with the username harpsichord dude doesn’t like Vegas? \n\nVegas is fun if you have money and like general debauchery like gambling, alcohol, cocaine, nightclubs, strippers, etc. \n\nOutside of that there is world class food, shows, shopping, concerts, festivals and hiking. And a bunch of art, professional sports, quirky exhibits etc. \n\nBut go ahead and skip it if none of that appeals to you! To each their own… and enjoy that harpsichord!",
      "Disneyland is a destination that offers essentially one thing. If you aren't going there to enjoy the theme parks or bring people who will, I don't know why you'd go there.\n\nDubai (aside from the serious ethical issues) isn't a domestic trip for all but .001% of the population and also has strict laws and restrictions that apply depending on race and status.\n\nI've been to Vegas....a bunch. Sometimes I gamble, sometimes I don't gamble at all. I'm not a big fan of the shows, but I've been to concerts there. I've stayed in shitty hotels and expensive suites. \n\nThe main reason I used to go there is because my local airport only had 3 direct flights and one of them was 100$ to Las Vegas. That's a nice cheap flight to get out of the cold. I was a broke college kid and Vegas could be done cheaply and still can (relative to other major US destinations). \n\nThe main reason I still go once a year or so is because I have a friends group scattered across the country. Vegas is a pretty reliably affordable flight from most major US cities and plenty of smaller ones. The planning is beyond simple. Book rooms and arrive. After that, you can just wing it and people can split up and do their own things and meet up later. You can pick a Michelin-starred joint or grab a drunken hotdog. You can go to a fancy club or sit in a dive bar or just walk around.\n\nYou can shop, catch a show, people watch, go to a sporting event, gamble, drink, eat, every kind of touristy thing, race cars, hot air balloons, shoot machine guns, do drugs, go to strip clubs, chill at pools and any number of other things if you're into them. You can party until the sun comes up or read a book on a hotel balcony and order in.\n\nIt's a bunch of stuff in an area made to be easy to access, that's easy to get to from most of the US, and can accommodate budgets from a few hundred dollars to many millions of dollars all in the same area. \n\nPersonally, it's not a vacation spot for me. It's a good place to meet up with friends for a quick weekend (2-3 nights max). It's not a profound spiritual journey, but it's not meant to be. It's meant to be a playground for adults. Some people aren't going to like that. Some people are going to love it.\n\nEdit: I also see Vegas trashed here *constantly*.",
      "I’m not the biggest fan of Vegas but it’s essentially an adult Disneyland partly due to the fact it’s the only place in the US outside on New Orleans where you can walk around with an alcoholic drink 24/7. \n\nI would never go to Dubai, especially since I’m gay.",
      "At least Vegas isn't owned by religious nuts and doesn't survive on slave labor",
      "The lack of a slave class of Indians is a edge over Dubai and a debatably healthier relationship with women.  Also, if my ex husband is to be believed on that front, in Dubai pretty much \\*everything\\* is expensive, and everyone who isn't virtually enslaved is ridiculously wealthy.  There's a ton that's affordable in Vegas and a ton of people around that are normal people, not people walking a cheetah or getting gold out of an ATM before they go drop 20 bucks on a BK Whopper.\n\nI don't particularly love gambling, particularly as the slots now pretty much just work as reverse ATMs and keep a tally, but if you play blackjack strictly by the book rules and have a fun dealer and fun table, I actually have a great deal of fun with the dynamic, get a lot of free drinks, and with blackjack and low table limits and book rules game play, I'm really not going to be up or down more than about 30 dollars at the end of a day.\n\nThe shows and spectacle and food/drink are what I've liked about it in the past.  I did quite like Fremont St and found it a great place to blend into the background and people watch.  I liked it more a while back when it was more just themed casinos.  I'm not a Disney hater either (except again, recent changes that just are overtly money grubbing) so it had this Epcot sense of instead of Disneyfied countries, it was Disneyfied castles, ancient Egypt, Paris, NYC, etc.  Now it seems like a lot of the casinos are just carbon copy too hip for this world attractions to the limo class, which is probably why I haven't been to Vegas since I got married by an Elvis impersonator to my ex husband.\n\nAnd the shows I've managed to see there, while breathtakingly expensive, were really worth the price of admission.  I had always responded to earlier reports on Cirque with a \"lul why\" when I was younger, but seeing Zumanity (particularly right in the aftermath of the Pulse shooting) was really special.\n\nFor those who don't like the gloss and spectacle, the desert clime there itself is its own thing to see (which it has in common with Dubai, but is a much cheaper flight for Americans) and you can access the Hoover Dam or Grand Canyon without too much effort.\n\nI do fully understand why people wouldn't like it, and it doesn't hold as much appeal for me anymore.",
      "I go to rock climb at red rocks",
      "It’s fun.",
      "I'm from Europe, and I was in Vegas once for about a day and a half when I was around 15. I was too young for gambling, strip clubs, and even drinking, yet I remember it as my favorite city of my entire cross-country roadtrip, with New Orleans being a close second.\n\nIt's an incredibly beautiful city, with so much to see. Looking out the windows as you drive through the city is an experience in and of itself. It's obviously famous for its street lights, gambling, etc., but it's also just a pleasant city overall. Beautiful weather, nice atmosphere, good food, lots of activities, etc. I had a great time even when I was too young to do any of the things you're \"supposed\" to do in Vegas, so I can only assume I would have even more fun as an adult. \n\nIt's a city with a very unique \"personality\". It feels alive, and there's nothing else like it, not in the US, or anywhere else.\n\nThen again, I also like Dubai and Disneyland, so maybe I'm the wrong person to ask.",
      "I think Vegas offers a lot to different types of people for a relatively modest budget. At least that's been my experience going there. Granted it's been a few years so perhaps things have changed. I personally can't stay in Vegas more than 2 days without being ready to go but that's usually not my aim. \n\n1. The obvious gambling\n\n2. Spa's, pampering, food, etc.\n\n3. Various shows.\n\n4. Access to nature outside of the city.\n\n5. International and competitively priced flights from many locations. \n\n6. Affordable car rental. \n\n  \nI've roadtripped from Vegas several times. Once rented a car for a month. It's a good location to start that. Grand Canyon, Red Rock Canyon, All 5 NP's in Utah, Death Valley, Sequoia, etc.",
      "In my early 20s me and my friends loved going clubbing\n\nMight go once a year nowadays for someone’s birthday\n\nAlso from California so it’s less than an hour flight away",
      "I went recently for the first time in a very long time and loved it.  Didn't spend a penny on drinks or gambling (just my preference, no judgement if that's your interest).\n\nWent to two concerts, one of which (Sphere) can't be replicated anywhere else (or until that new Sphere gets built). Saw a Cirque show which is always entertaining. \n\nTook a bunch of cool pics like from the top of the Eiffel Tower and the famous Vegas sign.\n\nSaw the Titanic exhibit which was surprisingly well done.  Went to the Cars of Hollywood of museum which was quaint and fun. \n\nGot to eat at a ton of places I don't have locally. \n\nWindow shopped at the high end stores. Took more pictures of luxury cars they had on display. \n\nSaw the Golden Knights play their home opener which was awesome.\n\nVisited the Shelby Heritage Center which is a must for any American muscle car fan\n\nTook a day trip to see the Hoover Dam. Didn't have time for the Grand Canyon or one of the other beautiful areas nearby. \n\n  \nI would totally go back in a few years to do all the attractions and places to eat I missed.",
      "I love Vegas strip clubs",
      "Las Vegas is insanely fun if you like events. Cirque du soleil, ufc, various musicians who do residency, restaurants, etc.. It’s not all about gambling. It’s all within walking distance.",
      "Double Down Saloon",
      "Once in a while, I like a little gambling, see shows, eat good food, and bit of debauchery with my friends. I do get tired of Vegas after 2-3 days but at least I don’t have to spend a lot of money getting there. ",
      "You could go to Red Rocks, it's only like 20-30 minutes away and beautiful with tons of great hikes. I'm not a huge fan of Vegas but there's a ratchet quality to it that I enjoy... it's not sanitized. It's not just a tourist destination; people live there. Old Vegas is cool too.",
      "Pretty darn nice hotels can be had for cheap if you time it right, easy to get good food, easy, cheap and plentiful flights, some good shows and it’s right on the doorstep of amazing outdoor activities and some cool areas and towns.  I was just there as a jump off for a road trip; got a suite for like $200, the weather was beautiful, and I spent zero time shopping or in casinos or bars.  I don’t really like Vegas (the strip) either but it is super convenient.",
      "I flew into Vegas last week to go to the Grand Canyon and I could not get out of there fast enough.",
      "As far as I know, bonded indentured  workers are not used for construction in Las Vegas, so there is that as a plus for a start\n\nAlso there is more personal freedom there too, and places to visit nearby (nearby in American terms)",
      "I’ve had a lot of fun there but now that I’m older it’s no longer appealing. I stopped there last night on my way to Utah and it was pretty fuckin’ gross. And overall, I find the casinos depressing.",
      "Leaving for Vegas tomorrow. Big Filipino community there, there’s even a Jollibee. Lots of good food, shows, nature, easy flights… and plenty of hotels.",
      "I agree. Vegas has just never been my scene.",
      "where else can you get married at 2am?\n\n(source: married my favourite wife in Vegas at 2am - together 19years)",
      "Everyone likes to feel pretentious about others travels. We all like different things and should accept that.\n\n\nExcept people who go on cruises. These folks are proper cunts.",
      "I mean, Las Vegas wasn't built with slave labour, so that might have something to do with it.",
      "I like the shows but hate the stench and depression of casinos. The aggressive salesman bug me no end. The heat and the crowds are awful. Don’t even get\nMe started on the traffic.",
      "Disney is a VERY specific type of overpriced and intense. Vegas has a very many number of varied overpriced intense experiences. Disney I want to go once when I was a child and once with future children lol. Vegas I can handle once every 3 years of my adult life for different things.",
      "It’s short and easy to get to from where I live.  There’s things for all ages, shows, professional sports, gambling, shopping, fine dining, everything is walkable on the strip (don’t have to worry about renting a car or figuring out public transit).  There are a variety of hotels from low to high end.  \n\nAnd if you want to do a road trip you have the Grand Canyon, antelope canyons and all the Utah parks on the NE, then heading west you have Death Valley.",
      "I have no problem with Disneyland. It's exactly what it purports to be. An amusement park where you leave reality at the door.  Haven't been since I was a kid, but am very much considering a day or two at Disneyland Paris as a small part of a larger trip next year.\n\nNo desire to go to Vegas or Dubai, though.",
      "There’s more to do in Vegas than drink/gamble/vice. I’m sober but still enjoy going. There are plenty of shows and live events to choose from. The hotels, while gaudy, are some of the most impressive architectural achievements on the planet with equally impressive interiors. You could spend at least a full day just wandering the strip going in & out of each hotel and checking them all out. Great restaurants. Vegas buffets are on another level. \n\nVegas is close. Dubai is on the other side of the world. No matter how you fly…that’s a shitload of travel just to get there. \n\nIf you’re looking for nature-type stuff to do then there isn’t much to offer other than desert and Lake Meade. Other than that it’s basically an adult playground. If you went there and were bored then you didn’t try hard enough. \n\nOne major con: it’s expensive…but it goes with the territory. If you’re going to Vegas you should expect to pay a premium…for everything. If you’re going there trying to skimp and save money here and there then you’re probably not going to have as good of a time…but that’s not really why you go to Vegas. If you wanna have a good time somewhere on the cheap, look elsewhere.",
      "I can go to the strip, shopping, upscale dining, the Mojave, the grand canyon, Hoover dam, city that never sleeps, if it just had some ocean...",
      "Dubai is not a bad place to visit. 2 days are enough to see Dubai and Abu Dhabi. \n\nDisneyland is an ideal destination for kids. Nothing wrong with going there. \n\nVegas is a good place for adults. There’s lot of a shopping, shows and great food in the area. ",
      "I like Vegas and have no interest in Dubai. \n\nVegas is kitschy and grimy and dirty and completely unapologetic about it. Sure it’s all artificial but it’s also authentic. The Venetian isn’t fake Venice, it’s real Vegas, if you get what I mean. \n\nIt’s also like egalitarian and non-judgmental. It’s where everyone in America goes to just blow off steam. Rich, poor, black, white, whatever, just fuckin get drunk, lose some money at the casino, catch a show, and then nurse a hangover in the pool the next day.\n\nDubai, is like, idk what people do there besides show off that they can go to Dubai. Any friends of mine that go to Vegas show themselves getting drunk, wearing stupid clothes, and like partying and stuff. Every friend of mine that goes to Dubai takes a picture of themselves trying to look rich on a rooftop pool or something.\n\nIdk, maybe it’s just me, but I’m more comfortable down on the street than high in the sky.",
      "I go there for hockey games once a year when my team is in town. It’s cheap(ish) and super walkable adjacent to the strip. But yeah… that’s about it.",
      "Yeah, Vegas sucks",
      "Open 24 hours",
      "Roll in on a Fri night, watch some drunk 22yo girl get carried off the Spirit airlines flight, hit the strip, roll out of bed on a Sunday $2k poorer with few memories of the prior 36 hours, head home. Repeat annually. It’s like an enema in vacation form. Not really enjoyable, but it gets some shit outta ya.",
      "I love roaming around ancient cities and museums as much as anybody but I also LOVE vegas and go multiple times per year.  \nThey have as good of dining as you'll find anywhere, I love the cheesy theming, I enjoy trying out some slots, the pools are great, there's desert natural beauty everywhere, there's world class concerts and shows, and sorry but I love walking around with a giant adult alcoholic slurpee sometimes. I'm going again in a couple weeks and absolutely cannot wait. It's also an easy weekend trip, at least where I live.",
      "I like Vegas for the residency’s. Other than that, I never have to visit.",
      "I like/hate Vegas.  Most times I go there, I change my flight and come home early.\n\n\nBut I like some of the nearby outdoors, Red Rock, Valley of Fire.  It's warm and dry in winter.  It's easy to get there from everywhere.  It's very walkable.  There's a lot of terrible food, and also some good food.  The people watching is top tier. It's on the way to cool places like the Grand Canyon.",
      "I don't like the Las Vegas strip, or any other part of Nevada (ya ya, Tahoe, whatever. I live in the PNW, I look around Tahoe and think \"ok, nice\"). \n\nThe Strip is noisy, too bright, and too many hammered people behaving badly. It has a definite vibe that's not my vibe. \n\nI've also been to Dubai. I don't like that city either. It's hollow and soulless. And honestly, if you're not into power shopping, it's boring and stuffy. \n\nThat being said, if someone from another country asks me where they should go in the USA, I would almost always say, Las Vegas. Why? Because there is nowhere in the world that's like it. It is completely unique, and it feels like no other city, it is interesting,  theres a ton of weird stuff to do. I'd also caveat that by suggesting they visit for no longer than 48 hours. Haha.\n\nI'd be happy if I never went to Vegas ever again. Which sadly probably won't happen. It's one of the few cities in the USA that has enough hotel rooms for massive professional conventions, that returning there, for me, is unavoidable.",
      "I visited Vegas one time for 5 days, and it is the only place I have ever traveled that did not divert from my preconceived notion one single time in my entire stay.  Seen Vegas on TV? Go ahead and say you’ve been there.",
      "It’s the Entertainment Capital of the world? \n\nHave you gone with a group of friends? I wouldn’t personally go alone.\n\nThere’s a show in every corner. Doesn’t have to be only gambling.",
      "Vegas is great if you've got money.\n\nTop quality shows, an incredible variety of great restaurants, lovely spas, high-end resorts, etc.\n\nIf you want to go and get absolutely showered in luxury and status and can spend what you like Vegas is a great place to spend a weekend.",
      "It’s fun and the hotel is ‘free’!",
      "I'm not much of a gambler but I enjoy vegas for a long weekend. It's just a critical mass of great shows and great food - which are two of my favorite things. Yeah, you'll pay an arm and a leg for that convenience. But it's definitely a good time.\n\nAll the fake replica stuff and theme'd hotels are fun to check out once. But I never bother with any of it when I go back.\n\nUsually I only plan a trip when I hear of something or someone I really want to see making a stop there. And I never fail to find a billion other stuff to fill the time around it.",
      "Let’s see, amazing dining, shopping, people watching, museums, activities, incredible shows, yeah it’s the worst.",
      "You don’t have to like it.\n\nI enjoy it because I like the occasional super fancy hotel stay, pools, good food and spectacular shows. I also enjoy going to the casinos, but only for a bit. There’s a lot to do there. The entire city bends over backwards to make sure you are constantly entertained.\n\nIt’s a fun place but it’s exhausting. Fun for a weekend.\n\nBut if it’s not your thing it’s not your thing. No big deal.",
      "Good for couple days long weekend for cheap flights / hotels, good shows, dining options, relaxing on the pools, people watching, gambling etc\n\nNot my favorite but I do not hate it either. \n\nAlso you can rent a car and reach many state and national parks if you want",
      "Vegas can be fun. And there's a lot more to do than meets the eye at first glance.\n\nFremont street is great.",
      "Vegas is a free for all. Come as you are, see some wild stuff, gamble and chase riches, find some crazy parties, beautiful people as well as some of the strangest or craziest. Find some luxury or feast on cheap/free drinks at casinos and wander from casino to casino without having to finish your drink first. I haven’t been in over 10 years but have had some awesome times.",
      "Vegas is a great jumping off point for some incredible national parks.  We go at least one a year.  We will fly to Vegas, spend several days at a park, and then go back to Vegas for a few nights.  Always enjoy the amazing restaurants, shows and spas in Vegas.",
      "I go to Vegas almost every summer with the same group of guy friends. We all used to live in the same city and play a low stakes, friendly poker game together. Over the years, most of the group has moved 5 it's the only time we all meet up.\n\nVegas is perfect for us. We rent a giant Airbnb with a pool and BBQ. \n\nWe tend to do the same general things every trip, which include:\n\n- We all play at least one big poker tournament. We go during the World Series of Poker, so that's a major highlight. \n\n- One night out. Usually, we will get dinner and see a show like Cirque or a magic show. Then we go to Freemont Street and walk around, pop into casinos, drink, and gamble.\n\n- One other activity, like hiking, shooting range, museum, or NBA summer league. \n\n- One night where we buy lots of expensive steaks, fancy beer, liquor, cigars, weed, and have a cookout at our Airbnb. \n\nVegas is the perfect for the trip.",
      "The surrounding mountains in Vegas have plenty world class activities",
      "I live about 4.5 hours from Vegas and it's one of two cities closest to where I live (the other being Phoenix) - so it's one of our main options for a quick weekend or getaway.  Vegas has great access to the outdoors (not in summer - but weather is awesome other times of the year for hiking) - we spent the week of Christmas last year in Vegas and had a great time.  Every day we went on a nice hike and had a great meal (we mostly eat off strip - love all the different Asian restaurants). We don't gamble or party hard, but always find plenty to do. Every time we are there I always say \"Vegas is so weird\" and it is not a place I would choose as the year's \"big vacation\" - but we always enjoy it for what it is.",
      "I am ambivalent about Vegas. I’ve been a few times but would be ok if I never go back.",
      "I live in Vegas and tbh the \"strip\" is way too crowded and expensive for me to enjoy as a vacation destination. If you've got the money it's a great place to go crazy. There is some good food options and some good entertainment options but for most people what you typically imagine when you think of las Vegas is simply not for them or our of their price range",
      "Growing up in Los Angeles as a kid and teen my parents would put us all in a van and make the drive the Vegas a couple times a year. They loved it. The only place kids could really stay at and have anything to do was Circus Circus hotel. As a kid I loved the place. All the lights and sounds were exciting to me. But as an adult, can't stand it. I don't gamble, I'm not a big drinker, I was never a big clubber. It doesn't have much to offer me. Many years ago I had a meetup of sorts with a group of friends and we stayed in Vegas with someone who lives there. It was the first time I ever visited Vegas without doing anything related to the Strip or Freemont St. We were in some suburban area and we went to nice restuarants, hookah lounges and went hiking in the Valley of Fire. That was actually the best time I've ever had in Vegas.",
      "I had a great time in Vegas and I don't gamble and don't party.",
      "Love Vegas - when I was a young hottie it was a place for girls weekends, now that I’m older it’s for spa treatments, nice dinners, shows and a little gambling.",
      "Love both Dubai and Vegas for different reasons.  \n\nVegas is an adult Disney land- solid dining, shopping, live shows, I also enjoy walking around the hotels, etc.  I don’t gamble, so don’t care about that.\n\nDubai, especially away from the tourist areas, has incredible cheap food and great, hospitable people.  The malls are crazy, I also love the infrastructure and seeing over the top luxury.  I don’t mind the restrictions, I’m a guest, I follow their cultural norms. ",
      "It's not for me, but some people like to give minimum effort.  You can go to a bar, a nice restaurant, see a show, gamble and never have to leave the hotel.",
      "Gambling?",
      "Everything you need in a getaway - Luxurious casino resorts and In n Out burgers",
      "Vegas to me is the perfect business gathering/conference location. There’s a ton to see and do in the evenings so you’re not bored between days. You can see a lot of talent doing their art; so many good shows of all kinds. You’re constantly stimulated so you don’t get miserable between days of your conference - since you generally have a ton of down time.",
      "I hate Las Vegas. I just personally don’t get it. The loud slot machines, the people drinking, the “bros” partying— it all makes me depressed and disappointed about people in general.\n\nBut, yes, of course, to each their own.",
      "I live in Las Vegas. I don’t gamble. I don’t smoke. I don’t work in the gambling industry. The only vice I have is spoiling my two Pekingese. Yet every time I go to the strip, I get a bit excited to see all the pretty lights. Most weeks there is World class entertainment here. It’s never boring. My favorite thing to do on my birthday was to go to the Beatles LOVE show and then go to Bellagio and see the fountains and then in to see the gardens. Don’t know what I’ll be doing this birthday since Beatles LOVE is gone. But the city has a lot of great people who work hard. There’s many other industries here besides the entertainment industry. There’s a lot of families who live here and from all of us to all of you who defended the city, thank you -  from the regular people of Las Vegas. 💞",
      "Never been to Dubai, but about Las Vegas, if you don't gamble and/or like to eat buffet, there's no reason to go there. As simple as that.",
      "When I was in my 20s: great night life, pool parties, free drinks and entry for ladies (made entertainment very cheap), lots of friendly, like minded people there to have fun\n\nIn my 30s: Great restaurants, shopping, and beautiful hotels",
      "The hiking is amazing over in Utah, also Red Rock Canyon and Mt Charleston. Just beautiful. Then you have the amazing dining and shows there on the strip for when the hike is over.",
      "Hookers and Blow.",
      "I go there for live music. It also has good food. 3 days is my limit.",
      "Listen.  I absolutely cannot *stand* Vegas.  The whole place feels predatory and dark to me.\n\nBut I will also readily admit that Vegas is kinda unique in all the world for what it is, and as such I do think people need to go there at least once to see it.",
      "Relativity is everything. Compared to Dubai sure, compared to conference rooms all over, sure. Compared to an actual resort almost anywhere else. No.",
      "I love it as a business traveler that has gone there a bunch for conventions because it has such a variety of restaurants and if you aren’t in to the gambling part, people watching and eating good food all within a close proximity is fantastic.",
      "Restaurants, shows, clubs, pools, gambling, party people. Vegas is a lot of fun.",
      "I went to Vegas for the first time last year. It was a work trip and I was dreading it, and just assumed it would be the hellish place I’d always pictured. \n\nI was pleasantly surprised. I mean the strip was awful but the people watching was great. And I did a lot of walking in other parts of town, as well as outside it. There were beautiful vistas of mountains, funky cool art stuff, and good food and legal pot everywhere. And the history was cool too. Even the old casinos had this haunting old world vibe. \n\nI think I enjoy a desert paradise (real nature not manufactured). It was unexpected and I’d definitely go back. Not my favorite destination but it exceeded expectations.",
      "It takes 1 hour for me to fly to Nevada and probably 18+ to Dubai. And at least I can get drink in Vegas",
      " Vegas is for partiers and gamblers- if you have that personality it is one if the best destinations in the world.\n\nIf you arent a risk taker- it is never going to make sense to you…",
      "Because Vegas knows what it is.",
      "I think Vegas is great for a weekend trip. ",
      "I grew up in the upper midwest and people like it because it's 1) Warm in the winter. 2) cheap. 3) Direct flights from smaller airports.",
      "I mean, as a non American I feel like there's this funny pop culture influence that really makes me want to visit. Just to see how lame, trashy and bizarre it is. The idea of a city of vice in the middle of a desert is weirdly appealing just to see it and then leave.",
      "I can walk to the airport and take a 40 min flight to Vegas for the day. Eat a fancy dinner, see a show and turn around and come home 24 hours later. It serves a purpose and I love it for that.",
      "Stopped off in Vegas for a few nights on my last National Park road trip.\n\nWas a nice to way to break up a few weeks of camping, eat at some nice restaurants, see some exhibitions, do some shopping and go to a concert. Didn’t a get a chance to get to a Cirque Du Soleil show which was a shame.\n\nIf you’ve got the money and going for a purpose (show, concert, event etc) then it’s a good spot.\n\nDid the same thing Dubai - stopped off a few days to chill out to break up the long haul flight.\n\nWould go to both places again as a stopover to break up a longer trip, but not as a destination.",
      ">What makes it worth visiting in a way Dubai isn't?\n\nThe strip is cooler than anything in Dubai, and there are lots of amazing shows and attractions? Yes it's somewhat tacky but that contrasts with Dubai's... sterility.\n\nQuite frankly I think that people who can't comprehend the appeal of Vegas (or Disneyland or Dubai) must be pretty high on their own farts. If someone came on here and said they didn't understand the appeal of Yellowstone or Yosemite people would roll their eyes at a blatantly contrarian take, and rightfully so.",
      "Vegas is a shitty scam designed to maximally extract money from consumers. At least they spend a little portion of that money on gimmicky themed buildings and fancy lights and fountains to distract you.",
      "I am literally bored out of my mind in Vegas! But I think maybe it’s because I don’t gamble?? The shows are fantastic though. Been there 2-3x’s and was def ready to leave on the same day.",
      "Vegas is for gamblers. If you’re not a gambler, you’re gonna hate your life there.",
      "High end dining for me. I go 1x a year on average and eat well. If wife comes, we do shopping, maybe an attraction like the Sphere, pool, whatever. I’ll gamble a little. Roulette. I know. I know. But, I like it.",
      "I think it sucks. Hot AF. Nothing beautiful nature wise. Hyper expensive. Lots of dirtbags. No thanks.",
      "I like Vegas for old downtown (Fremont) and for Red Rocks, Mt. Charleston and for festivals like EDC, Reggae Rise Up and others. The strip is ok, but I’ve done it so damn many times that it doesn’t even register any more. The little china town area around Spring Mountain Rd has some fun stuff too.",
      "Grab a meal in Chinatown, people-watch on the Strip during the day, and soak up the energy of Fremont Street at night.\n\nIf you stick to the usual spots, Vegas can feel touristy. \n\nBut if you know what you’re looking for and actually spend time doing the research (gasp), you’ll find places that truly deserve their merit. \n\nThere is always something new to try, no matter how many times you visit.",
      "Vegas can be whatever you want it to be. \n\nYou want a vacation where you drink and gamble, easy. You want a fancy dinner with a show, done. You want to shop all day, no problem. You want to sit by the pool, there’s that too. You want do to excursions all day, it’s all there. \n\nIt’s easy to go back and not do the same things. I’ve been a few times both for work and fun. It’s an easy get away.",
      "I loved Omega Mart and Area15, the food is good once you leave the strip, the shows are super cool and entertaining, the architecture and the lights are stunning, and the street performers are talented.  I also really LOVE people-watching - whether they’re too high/drunk or they’re going through a bad gambling bender lol.",
      "I don't like Las Vegas for Las Vegas.  I like Las Vegas as a jumping off point to do other things that happen to be relatively near it.  There's a lot of natural attractions in an 8 hour driving range.  It's an easy city to get to, the airport is logically laid out and easy to navigate, rental cars are cheap-ish, etc.  I'll see  a show, eat at one of the restaurants, and then leave to do other stuff.\n\nI can't imagine spending more than 1-2 days there at a go and not even that during peak times.",
      "I know this is shocking to people on Reddit, but *different people like different things*.",
      "I like going there to chill and do guy stuff. \n\nI generally, sleep late, go to the pool during the day, then have a nice dinner, theres lots of great food in vegas. Then i usually go watch some sports and place some minor bets while drinking for free and smoking a big cigar.\n\nSometimes ill then go hit a craps table for an hour to two and go to bed. Occasionally ill catch a show if i like whats in town. \n\nRarely spend more than 1500 bucks for 4 days, and just chill the whole time. Its not a destination vacation for me, its a \"get out of town\" for a few days and reset type of thing. Sometimes my wife comes and sometimes she doesnt.",
      "The hotel rooms are nice and The Sphere is fun.",
      "It’s better than spending 1K just to spend majority of it falling in line in Disneyland, for 3-4 1minute rides. At least in Vegas, you get to see a lot of things, eat different things, and do a lot of things, for kids or adults. Now if you choose to highroll, that’s on the person.",
      "I keep going back to Vegas for the brunch buffets and concerts. I love going to a show, rave, whatever - lots of good music comes through- and then I get my brunch buffet and life is good. Music & Food.",
      "To me Las Vegas is a capital of consumerism in a good way :) I think everyone should visit it at least once to see a place where entertainment and pleasure are turned up to the max.",
      "If you go to Vegas and your entire time is spent on the strip, you're doing it wrong.\n\nVegas has some of the best food options in the world, but off strip. \n\nAlso, red rock is nice, valley of fire is also great. \n\nJust avoid Vegas between May and October.",
      "I've not been there s much as most regulars, only like 6 times.\n\nBut let me give you my take. \n\nWhat's great about Vegas? \n\nLas Vegas is a place you can fly into for 2-4 days and be your absolute worst version of yourself. And here's the kicker- it's fine. \n\nEveryone there is doing the same thing. \n\nYou a gambler? Get off on the rush of big wins or losses? This is your Mecca. \n\nGambling doesn't do it for you? How about gluttony? Any food you want in the world, they have it, and in spades (ha). Buffets, sushi, brunch, steaks, seafood in the middle of the desert!!.\n\nOk fine, no gambling and you're not an eater...how about sloth? You can get a hotel with poolside service all day. Kids annoy you? Adult only pool area. Boom. Do nothing but bask in the lovely April desert sun for 4 days...Vegas is happy to have you. \n\nCulture? Ok-how about dozens of the biggest names you grew up with doing shows and residencies? It's Brittany, bitch...\n\nWanna cosplay Hunter Thomson? Go for it. Booze is cheap and easy. The streets are full of people hocking a DARE officer's worst nightmare...pick your poison (responsibly) \n\nAnd the list goes on. Sex, clubs, guns, spas, shopping, all of it!! \n\nVegas is a an international, blow-off-steam, amusement park of a city. \n\nGo there, be your worst self,  tip your service staff well, and revel in the fact that everyone's being bad. \n\nThen leave, go be a real human succumb to the drudgery and responsibilities of society. \n\nCome back again in 6 months to a year to let that pressure valve go again.",
      "I've been to Vegas twice, both times for a work convention, but I flew in the Friday before so I had the weekend to explore. \n\nThe first time I drove out to Red Rocks, saw the Michael Jackson Cirque du Soleil show (fantastic), and checked out the lobbies of some hotels (Bellagio is very impressive with the Chihuly glass and indoor garden). I don't really gamble, but I do drink, so I sat in Paris - live the decor - and played the penny slots and have a few free drinks. The second time I drove out to the Hoover Dam. I would have loved to see more shows and eat at celebrity restaurants, but my budget didn't allow it.\n\nIt's not somewhere I'd choose to go again, but if the opportunity arose - a work trip or getaway with friends - I wouldn't say no.",
      "All of the sinful fun stuff you can do in Vegas is illegal in Dubai.",
      "Definitely worth visiting once. Even if it's not your 'thing', you owe it to yourself to experience it and see what it's all about. You can 'participate' or just go and observe. Regardless it is worth doing on e.",
      "Vegas….armpit of the nation!",
      "I actually found it a bit depressing filled with loads of people who didn't look like they had money to lose sitting at all hours in the dark, losing money.\n\nWe were staying at the Belagio, pretty smart hotel too, sort of sureal looking at the Disneyland architecture with these incredible mountains in the background, but I just couldn't bring myself to want to bet, it just didn't look enjoyable, I don't know what I was expecting, maybe Robert de Niro & Joe Pecci or the rat pack ?\n\nGift from the Mrs, helicopter ride to the base of the Grand Canon made up for it...breathtakingly spectacular out over the desert & the Hoover Dam at dawn.\n\nSounds cheesy, but the helicopter pilot knew his stuff, he flew over the lip of the Canyon to the sound of 2001 space odyssey & flying within the canyon prior to landing was a memory of a lifetime",
      "Vegas has a lot for different people. Gambling. Great clubs. Very good dining. A wide range of interesting shows. Outstanding conference & event facilities.\n\nIf none of those appeal to you, no problem. I haven't been for 12 years, I'm happy with that, and it's not on my list to visit any time soon. Some people go annually or more, if they enjoy it, great.",
      "I have no idea.  Not a fan.",
      "Nostalgia.  Vegas used to be an adults playground.  Now it's Disney for saddos.  That being said, it's infinitely better than Dubai as it's not owned by slavers and frequented by the worst people on the planet.  If you visit Dubai, you deserve whatever judgement comes your way.",
      "I have never understood the Vegas attraction",
      "i’d love to go to vegas one time.  dubai?  not a chance.  nope. no way.",
      "It’s an entertainment city, great for gambling, great for partying, great for going to a world class Cirque du Soleil show, great to attend major sports events and major concerts by world famous artists, great to walk the main boulevard as a tourist enjoying life if you have the money.\n\nWhat really is that difficult for people to figure out? Honestly…",
      "I like it because of the 24/7 dispensary right off the strip; Reef dispensary.  The times I’ve been to Vegas, I’ve usually been on a work related trip so I get to enjoy amenities rather than pay for them.  It’s only been one time I was there and didn’t have some sort of 3-4 day gig and that was the first time I ever went with an ex girlfriend.  To be fair, back then, I really didn’t think much of it but I didn’t really spend too much time there either.\n\nMost times I’m there I really just get to walk around and smoke.  It’s relaxing in a way and I enjoy seeing everyone moving around.  I was actually there just the end of last month and thought to myself why I enjoy it so much.  I don’t gamble, barely drink, yeah I smoke weed but that’s about it.  However, I’m really a fan of being able to walk around places with people, doing my thing vining out and Vegas has that.",
      "World class rock climbing and great Chinese food.",
      "I’ve been there throughout my 20s. My activities changed every time as I have gotten older but they have great shows, festivals, and top notch food. Gambling is meh for me but it’s great place to for entertainment even if you’re not into the debauchery of the nightlife or even day time pools. You can also take tours to the Grand Canyon. So overall it’s a great consolidated location many activities for many different types of people.",
      "i wonder too… i used to be able to try and enjoy it when i was in my 20s but even then, i always thought it was gross, expensive drinks, dirty and too hot. now i don’t go unless i have to layover there.",
      "I've driven past/through Vegas a couple times, absolutely zero desire to do more.",
      "It’s fun if you only stay for a short time. There actually is more than just gambling there. If you take that part out of the equation you can find some interesting shit there.",
      "It’s fun for 2 days…after that I hate it",
      "If you like shows, Vegas is top 3 destinations in the world for talent. Every show has some of the most talented singers and dancers in the world. Also, architecture. Always fascinates me what $1B to $7B can build.",
      "Vegas is a good location for a group trip with people who want to do different things. Gambling, shopping, shows, restaurants - with naps in between bc everything is pretty close. Not my fav vacation destination by a long shot but a weekend every few years with friends is alright.",
      "What happens there, stays there. Nuff said.",
      "Former Vegas resident here to defend (as I do regularly across the internet).\n\nVegas has some of the best outdoor recreation in the entire United States. If you want to have endless options to hike within 30 minutes to 3-4 hours, Vegas is the spot.\n\nLake Mead, Mount Charleston, and Red Rock Canyon are all within 30-45 minutes away, and it would take years of weekend wanderings to even get the gist of any one of those crossed off by hiking them.\n\nThere are ghost towns to explore, 4X4 trails to drive, rock walls to climb, tons of federal land to just drop a tent down and camp where you'd like, Lake Mead and the Colorado River for water stuff, tons of Utah, California, and Arizona state and national parks within an afternoon's drive, on and on and on.\n\nI've heard the city has some decent entertainment and food options as well.",
      "Because you can drink, gamble, sit at a pool, go to sportsbooks, play golf and go to a concert all in the same day. It's not hard to grasp.\n\nIf you were too afraid on Fremont street when you saw people enjoying themselves maybe go on vacation in Tulsa or Provo.",
      "Because there are actually people all around Vegas making everywhere lively day and night. Dubai when I was there, I would not see people unless I’m INSIDE a mall/hotel or INSIDE an attraction.\n\nVegas landmarks don’t give off a pretentious vibe. You know they are built to be rip offs and fake and they don’t pretend to be otherwise.\n\nDubai’s landmarks are all built to be the tallest of this, the only 7 star of this, the biggest of this. But they are nothing but shells of bricks and concretes with no history or culture behind them. They are just as fake and rip off, but give off that pretentious vibe of being better than everyone else.\nAnd then you see the VERY apparent divide between the ultra wealthy and ultra poor of middle easterners vs south Asians, makes it feel like even more of a city of just the wealthiest being overloaded with money with nowhere else to spend but use to show off to you. Made me kind of want to throw up.\n\nVegas I went 3x, knew what I was getting into and had amazing time.\nDubai I went 1x with this expectation of an amazing city from all the travel ad campaigns by them, I never ever want to go back. It’s a soulless vessel of a city the rich use to show off their wealth.",
      "OMG ... it's terrible. It's like the worst of USA all in a single strip.  SOrry, I know you were looking for what the appeal is, but the only one I can find is the weather. I'd rather go on a cruise, which I also can't stand.   your mileage may vary.",
      "Wait. People like Vegas?",
      "Vegas is Paris of the USA.   \n  \nParis is adored by Americans, and hated by Europeans. Vegas is adored by Europeans and hated by Americans. I suppose any kind of trash can be cool when it's not present in your life too much :)",
      "I like Disneyland and hate Vegas, guess I'm not much of a traveler.",
      "Vegas is good for like 3 days that’s it. I used it to see a music festival and do a little gambling then went to the Grand Canyon and Zion National park. The mob museum was cool also.",
      "Fly to Vegas, rent a car and head out of town on a national park road trip to the Utah 5.",
      "This year I was planning to go to some concerts. With the similar lineup, I could went to San Francisco, freeze my ass on the pier and ended up walking miles before get a Uber. Oh we chose warm Vegas with comp rooms, pools and all walking distance.",
      "I think Vegas is cool for a few days. Good food, quirky attractions, steeped in Americana, and a good base point/rest stop to get access to some beautiful desert scenery and further to the awesome scenery in California",
      "You’re comparing Dubai to Vegas? Nothing more needs to be said than it’s a 2-3 hour flight for most of us versus a 12 hour flight. For better amenities and less bullshit (cultural idiocy, arrogance etc.)",
      "Couldn’t tell you",
      "I love it. I would argue the best restaurants anywhere in such a small area. Great cocktail bars. Affordable hotels. Great weather. World champion of people watching and something for everyone.",
      "I don't get it either. America's NEOM",
      "Great Restaurants, gambling, booze and hookers..in that order",
      "My wife and I love Vegas and visit probably once a year. For me, it’s simple: there’s something for everyone. You can go with friends, as a couple, individually, and yes, Vegas can even be a family destination.  \n\nWant to do some high end shopping? Check. \n\nWant to be a glutton and eat some great food? Check. \n\nWant to be a degenerate gambler? Check. \n\nWant to see some great shows/concerts? Check. \n\nWant to get away and relax for a few spa days? Check. \n\nWant to play some great golf at fantastic courses? Check. \n\nWant to get housed and at some of the top clubs? Check. \n\nWant to get sexy at a myriad of diff pool parties? Check. \n\nLonely and want to legally pay for sexual favors? Check. (Though technically this is ~30 min outside of Vegas) \n\nThere aren’t very many places that can check all of these boxes and the scorching desert heat aside, Vegas can literally be something for *everyone*.",
      "It’s becus they can’t see a Muslim country doing well. Guarantee you any of those places in Dubai were in Vegas or anywhere in Europe. People will be lining up to go there. Yeh we know human rights, like that western country that Vegas is in, isn’t guilty of human rights abuses since WW2. Just two faced 🤡’s everywhere. And yes we know it has no soul and culture. Becus you can’t be a degenerate drinking on the streets & doing drugs, and shoot up schools and neighbourhoods.. and oh yes pickpocket people without getting caught and can’t be a degenerate in public.. Vegas is a stretch, but I don’t see any of them have any issue with Singapore is a better all round comparison. Dubai ain’t a main destination. It’s a place to do business, work tax free and to enjoy a fancy stopover. That’s it",
      "As a snobby traveler who goes to Europe to see opera and classical music, I enjoy Vegas oddly. It's mindless. Also, there is some fantastic nature stuff to do close to Vegas, like Death Valley and the Grand Canyon. I like shopping, eating, playing cards, and going to the pool. Vegas has a fascinating history—it's mob history and stuff. Also, the Neon Museum is one of the coolest museums I've ever visited.",
      "Vegas is fucking awesome.\n\nHas a huge selection of amazing restaurants, low and high class, world class entertainment, plus great hotels.\n\nObviously gambling and nightlife. \n\nVegas has great hiking and world class rock climbing. And a few hours away is Zion, Bryce Canyon, Arches nation parks. \n\nThe only downside is Vegas is expensive. \n\nBut it’s a great place.",
      "Vegas is Disneyland for adults. Can’t speak about Dubai cause I’ve never been but from what I’ve seen, it’d be a great place to visit if you had have money. The whole human rights sentiment feels overboard but that’s Reddit for ya",
      "I hate Vegas because I’m not in my early 20s anymore",
      "Vegas is an entire city made of plastic whose appeal fades quickly.",
      "I agree I have been to Las Vegas 4 times now throughout the years for birthday parties and other trips with my friends and I think it is the cheesiest most overhyped place of all time. For people saying oh you probably didn’t do it right, I definitely did it as good as I could. Went to the Wynn was in a sweet all that good stuff. Every time I go there I realize how big of a tourist trap it is.Yes maybe losing a lot of money influences this decision. But on another level with the amount of money you spend there I think there are 1000 other trips that you could spend half the money on and have twice as good of an experience. Maybe it’s just me but I think if you are looking for unique new experiences there are way better places to go. But if you want to spend thousands of dollars and have a lot of regret, Vegas is the place for you.",
      "Buffets",
      "I don’t like Vegas. I think Dubai is at least more diversified, though I don’t like that city for visits either."
    ],
    "comments_lev2": [
      "This is true. I went to Vegas my first time when I was 27 for a friend’s bachelor party. It was super fun but a wild and exhausting 48 hours or so. \n\nTrips 2 and 3 for both for the same annual conference in Nov 2023 and Oct 2024. Will be going again in Jun 2025 for a different conference and likely fall 2025 for the conference I’ve just done 2x.\n\nThe conference I just didn’t years in a row was always in San Jose CA pre pandemic but when it resumed in 2022 it moved to Vegas which is a million times better for a conference than San Jose. I’d imagine it’s better than most cities for conferences and has far more reasonable rates better properties and so much to do.\n\nAs an almost 40 year old with way more income to spend than my first trip, Vegas is even more fun now. Especially since not going to just party.",
      "I've been there three times this year for work conferences. I don't mind it, but I don't gamble or drink, so I'd never go there by choice. It's certainly a place that I think people should see once in their life.",
      "They do run out of hotel rooms sometimes, for all intents and purposes. Last time I had to stay there for one night, there was one room left 20-30 miles south of Vegas, and it was like $300+. There *were* some rooms in the city, but they were thousands of dollars, some of them even for $10k+. All the off-strip places in Vegas/Henderson/etc. were sold out. At least the Ubers were pretty reasonable.\n\nAnyway, there are a decent number of events and concerts there. I might rather fly into Vegas, *usually* have cheaper transportation/lodging, usually be less crowded than, say, flying into LA (if the event/concert is a tour). Breeze also connects directly to Vegas from some east coast cities, you can sometimes get a one-way for like $70.\n\nI'd also say, a couple of the hotels on strip I've stayed at have been fantastic, much better than hotels I've been at in most cities. Free parking (presumably because they want you to gamble even if you're not staying, though parking can fill up on the weekends), rooms themselves are super quiet even though it's a party downstairs, and tons of restaurants without having to get in a car to go anywhere, can walk to events at other hotels on the strip, and they often have the rooms ready several hours early if you arrive early.",
      "Yup, and the complaints are always, \"It's so fake and tacky!\" Yeaaaaah....that's not some great revelation. It's actually kind of the point. No one is going to Vegas expecting to see the real Eiffel Tower or Venitian canals. If fake and tacky aren't your things, fine, but people need to stop thinking they're some kind of cultural connoisseur for pointing it out repeatedly.",
      "I hate Vegas as a town but I love the incredibly beautiful nature around it.",
      "People still have fond memories of highschool. Regardless of the fact that highschool and prison both have fences and bad food. The sex you are wanting you aren’t getting, and the sex you are getting you don’t want.\n\n\nVegas is like that.",
      "He didn’t seem worried about it more curious as to why people seems to like one place and not the other.",
      "I was never interested in Vegas.  I grew up up in a small town in the rural midwest in the 1980s.  And the ladies I worked with (as a teenager) at the local grocery store would save for YEARS (5-10 or more), really keeping a tight budget to squirrel away every penny all to go to Vegas and PRETEND to be rich for a few days and blow it all gambling. These families never saved for retirement, had no plan if they ever had to stop working. It was just frankly sad.  My mom taught me to enjoy today- but plan for tomorrow too.  If those ladies and their families had put that money in the stock market?  They would have retired in the early 2000s with millions. \n\nAnd I went to Vegas for a conference in my undergrad years... I have a few memories:\n\n\\- GROSS buffet\n\n\\- SMELLY, loud, gambling rooms\n\n\\- Coupons handed out on the street for prostitutes. \n\nMany years later, I had to go to a professional meeting at one of the nicest hotels on the strip...and I watched a gross man smoke a gross cigar inside, next to a 10K+ Christian Dior silk gown.  And I just could not. I would never buy such a dress. But to stink it up and ruin it with gross cigar smoke?\n\nI never understood gambling as entertainment though.  It does not compute. So YMMV.",
      "Is this the real Caesar’s palace?",
      "> The city is a playground\n\nYep, and as far as I've seen it's the best playground city in the world (at least in a middle class-accessible fashion.) If that's not your cup of tea, fine. But you should still give credit where it's due.",
      "Their former mayor was a mob lawyer, I kind of love that",
      "There is a ski area just up the hills.",
      "It's also a great starting spot if you do like nature. All of Utah right at your fingertips to the east.",
      "There's actually some pretty cool nature just outside of Vegas. Our last trip included hiking in Valley of Fire State Park and off-roading in the Mojave as day trips. \n\n\nI hate the grift vibe of Vegas, but there is tons to do. ",
      "Well for one, the ridiculous bloated prices and fees for everything at every turn is one thing not to like",
      "You could afford to go to the f1 race in Vegas? Jealous!",
      "There is lots of culture in Vegas.",
      "Any hotel recommendations?",
      "Funny, cause one of my favorite things to do in Vegas is rent some dope af sports car on Turo and drive up to Mt. Charleston with my best friend. Scenic af drive throughout, with some amazing vistas close to the top. Last time I went to Vegas I went with my sister and hiked with her through the Valley of Fire national park. There's genuinely so much to do in Vegas that doesn't involve gambling or going to shows, etc., especially if you know what you like to do!",
      "Yes Vegas is fun if you can afford to spend 5k on a weekend trip.",
      "I mean, nobody can just watch the F1 race lol",
      "Plus im assuming that Vegas is not built on the back of slave labor of people from SE Asia who are bullied and exploited. Their passports are confiscated, they are made to live in shabby accommodation and are paid peanuts. Worker safety is non existent and there is an undercurrent of racism.. that’s Dubai for you. \n\nIn my knowledge Vegas doesn’t come close to this.",
      "FWIW you’re not going to get in trouble for holding hands with your partner in Dubai.  Just no PDA.  ",
      "Great food also. It has a wide variety of food in one city. ",
      "True that. Been there twice and still haven't seen everything. Nothing beats grabbing dinner at a nice restaurant and then catching a Cirque show. The whole Strip at night is just something else - especially from one of those sky bars. Plus the hotels are basically art pieces themselves.",
      "Wouldn't much of this apply to Dubai as well though? I know plenty of people who have gone there (one of the few places people from where I was born can go cheap and Visa-free) and the positives they had to say was always \"beautiful at night, central area around Burj Khalifa is gorgeous, lots of shops, we went dune buggying\".",
      "UNLV actually has a collection of harpsichords.  Just sayin’.",
      "Funny enough, the previous owner of my harpsichord really likes the Bellagio's art collection.",
      "Wtf is harpsichord?",
      "Savannah, GA enters the cat",
      "No, it was built by the mafia and survived on dirty money, murder, drugs and prostitution.",
      "It’s funny you say this I lived in Vegas and there’s a really weird issue with Mormons and the LDS church. In fact there was a recent lawsuit against the city of Vegas cause of a lds church built up on lone mountain lol",
      "From the outside, looking in, that's exactly how the US looks, tbh.",
      "Debatably is doing a lot of heavy lifting there",
      "> I don't particularly love gambling, particularly as the slots now pretty much just work as reverse ATMs and keep a tally, but if you play blackjack strictly by the book rules and have a fun dealer and fun table, I actually have a great deal of fun with the dynamic, get a lot of free drinks, and with blackjack and low table limits and book rules game play, I'm really not going to be up or down more than about 30 dollars at the end of a day.\n\nYeps.\n\nDropped $20 on blackjack, got a couple of drinks and came out with $60. Even if I’d lost the $20 - still not a bad amount to spend on entertaining myself an hour.",
      "Username checks out. What a dump, but popular. Halloween was so packed you couldn't even see the obese peep show.",
      "Yeah this is a great succinct write up, you really can get luxury for a good price.",
      "Nonsense! People visiting gambling spots couldn’t carry less about such things. Gambling is about different issues.",
      "Oddly enough, it depends on what you're looking to do. To this day, I can have a cheaper night on the strip than I can a night out in my own city.\n\nThe spending floor is very low, but the spending ceiling is non-existent in Vegas.",
      "I love checking out the different hotels!  They’re really modern architectural and engineering marvels",
      "Related story I had a sibling that lived in Las Vegas for a while. We went out for Thanksgiving and stayed at hotel. My husband was playing blackjack. Every other person at the table ordered coffee. My husband made small talk and found out they were in town for an AA convention.",
      "Yes, it’s you, plus your prejudice. There is nothing great about Las Vegas and nothing worth praising. \n\nAll gambling centers depend on passing moods and social trends. People are following what others do. (Once even Atlantic City used to be cool).",
      "Vegas is exactly what it advertises itself to be.  I’m not sure what people think it should be like",
      "You can do those things in almost any American city",
      "How is the weather the appealing part? Lmfao",
      "Reddit is obviously a reactionary place, but the human rights stuff isn't overboard in this case. They recruit  migrant workers from impoverished areas around the world with promises of high wages. The workers often sign a loan deal with the recruiters for several thousand dollars at 10%+ interest to cover airfare and visa costs. The recruiters then sell their laborers to construction companies. When they get there they find out they're making 100$ a month to work construction in the desert. Often times their passports are seized and multiple months of pay are held on the promise that if they keep working they'll eventually get the back pay. \n\nGo check out a video of the labor camps they're housed in. Multiple human rights groups agree on between 20-25,000 migrant workers dying a year due to living and working conditions in the rich Gulf states (UAE, SA, Qatar)."
    ]
  },
  {
    "id": "1gxmrqx",
    "title": "I cycled across Oman. Here are some pics",
    "text": "Photo Locations:\n1-3: Western Hajar Mountains\n4-8: Jabal Shams Mountains\n9: Muscat\n10&11: North Coast Fishing Villages\n12-15: East Coast\n16-18: Dhofar Region\n",
    "comments_lev1": [
      "I’m currently cycling around the world and this past winter I spent two months cycling in Oman 🇴🇲, a.k.a. the hidden gem of the Middle East, a country which surprised me with its natural diversity, laidback way of life & hospitality. I wanted to share some pics & thoughts.\n\nAs soon as entered Oman from the UAE, I took a turn onto a small road heading into the Hajar Mountains. I was rewarded with a rugged but beautiful mountainous landscape, and butter-smooth yet empty roads. This part of the country is sparsely populated, and you will come across many more goats than humans. Despite this there are frequent drinking water dispensers on the side of the road, often even cooled!\n\nIf you are looking for a challenge, search for unpaved roads or paths on your maps, as these usually lead through Wadis, which are dry river beds, resulting in short, but unimaginably steep ascents, often reaching inclines of 30%. This meant a lot of bike-pushing, which even in winter is exhausting as temperatures were still hovering around 30C.\n\nVillages are sparse but very scenic, and also felt quite conservative, often the only people speaking English were migrants, mostly from Pakistan or Bangladesh. One afternoon a Pakistani family invited me for dinner and to spend at their place, and even offered to slaughter a goat for me, which I declined.\n\nAs I continued my way south and left the steep Wadi roads behind, I came across the first foreign tourists, most of them visiting the historic cities of Al Hamra and Nizwa, famous for its forts and date plantations. Here you will also find the Jebel Shams, with just over 3000m the highest mountain on the Arabian peninsula. I took a short break to rest and to do some hiking.\n\nI then made my way towards the capital of Oman, Muscat, mainly to replace my broken camping stove. Apparently there are some nice beaches around Muscat, but I only spent a day here as I cycling in cities designed for cars will never be fun to cycle in (looking at you, Dubai!). However, Muscat marked the starting point for the long journey towards Salalah, Oman’s third biggest city, and the only major one in the south, close to Yemen. The distance via the highway is about 1000km, however it crosses Oman in the centre, which is mostly a massive wasteland, with few resupply points.\n\nInstead I wanted to cycle ~1300km along the coast, where I would pass through some small cities and fishing villages, and the landscape would be a bit more interesting. Or so I thought.\n\nShortly after I reached the North-Eastern tip of Oman and started heading south, the landscape became extremely monotonous. Most of the time the road was actually a few kilometres inland, so I couldn’t quickly hop into the ocean to cool down or relax at the beach. I was surrounded by a empty, flat land with nothing more than a few bushes and the occasional camel for the next two weeks. That was longer than planned for this stretch, reason being that during the first week I was facing strong headwinds making the ride even more challenging, physically and mentally. Fortunately two fellow German bicycle travellers were also in the region, so we met up and made the boring ride a bit more entertaining.\n\nAfter a few days together we parted ways and I slowly started to appreciate the solitude, reason being the lack of cars, silence, clear night skies and the fact that the headwind was gone. I started making process and soon reached the mountains of the Dhofar governorate, of which Salalah is the capital. A spectacular scenery can be found in this region, with pristine beaches on the left, steep mountains on the right, and scenic Wadis in between. In summer it is supposedly even more picturesque, when the entire landscape is green and full of life thanks to tropical storms (‘Khareef’) bringing in lots of rain. Temperatures will also drop below 30C, making it arguably the only place in Oman where one could cycle during summer, when temperatures in rest of the region reach 40+ degrees Celsius.\n\nAnd just like that I had made it - cycling almost the entire length of Oman. Continuing further south into Yemen wouldn’t have been wise, so I flew to Kyrgyzstan to continue my journey around the globe.\n\nLooking back, Oman is definitely among my favourite countries I’ve been to. You will be surprised by its diverse landscape and warmly welcomed by the Omanis and migrant workers alike. Cities are modern, there are many cheap restaurants and free drinking water can be found at mosques. It’s also one of the safest countries in the world, making it an option for solo female travellers. On that note, I was surprised how few local women I’ve come across during my two months here. Oman is quite a bit more conservative than the Emirates for example in that regard. On the flip side, this means that you will find beautiful traditional architecture  instead of skyscrapers.\n\nThanks for reading, you might be interested in the posts I shared cycling across [Iran](https://www.reddit.com/r/pics/s/f8eYro9miN) and [Mongolia](https://www.reddit.com/r/travel/s/MAycJ4BGjd).",
      "Always love seeing your posts, stunning pictures as always, and beautiful storytelling, thank you",
      "Love the pics and planning on going to Oman again.\n\nDid a road trip there a couple of years ago and it was brilliant.  Stayed in a small village one night and it was so nice.\n\nMuscat was chill too.\n\nThe natural diversity was also a surprise.\n\nDid you go swimming in the Bimmah sinkhole?",
      "Best country in the Middle East and it ain’t close",
      "Literally just got to Oman, checked into our hotel and opened Reddit to see this post. Perfect timing. Beautiful pictures!",
      "I long to visit Oman and take in these beautiful landscapes",
      "ما شاء الله",
      "O man that looks great",
      "These photos are amazing, OP. Absolutely incredible.",
      "Amazing! I;ll be headed on a 4 day bikeapcking tring in the Hijar, starting from Nizwa, doing a 200 mile loop. My only concern is food, it seems that there will be spots here and there, but nothing concrete on my end, any advice for food stuff in the Hijar Mountains?",
      "Hell yeah dude. I live in the UAE and weekend trip to Oman are such a nice escape.",
      "What camera did you use? The pictures look amazing",
      "Absolutely gorgeous photos! Approximately how much did \n your two month jaunt cost?",
      "Omanis are such a lovely group of people.",
      "Incredible experience!",
      "I'm not going to lie place looks beautiful",
      "Really cool pics, thanks for sharing!",
      "What a beautiful adventure! Thank you for sharing!!",
      "Awesome! Any videos? If you had a YouTube channel I would definitely watch it. Wouldn’t even need commentary just the footage! Will look out for more of your stuff.",
      "I am curious to know what camera you used to take these incredible photos!!  Thank you for sharing.",
      "Oh man, that's sweet",
      "Beautiful.  Would you say it’s safe for foreign women?",
      "I lived in the UAE back in 07-09 with my family and I was in Boy Scouts. For our camping trips we would often travel to Oman and camp there. Those were some of the most amazing camping trips I’ve ever experienced. Exploring the Wadis was incredible and hiking the mountains felt like  a whole other world to me. These photos brought me right back",
      "And yet still the patriarchal struggles for women are horrible for Omani women today.\n\nSure they’ve made some progress, but to see almost only men out in public from your pictures tells the story of oppression 😞",
      "Oman, that must've been incredible.",
      "It’s so beautiful there can’t wait to travel outside the states",
      "Wow, a gorgeous country. And you captured it very well.",
      "Incredible, what an adventure!",
      "Wow! What a stunning place. These pictures are incredible.\n\nWhen I saw the pic of the kids, I did find myself thinking, “Enjoy that freedom while you can, girls.” The lack of women in the pics is obvious, which makes me wonder how safe Oman really would be for solo women.\n\nThank you for sharing these and best of luck on your journey!",
      "Hi /u/MaxRoving, Thank you for your submission. The mods have been notified and it will be checked in due course - there's no need to message them.\n\nIn the meantime please **ensure it has the country in the title** and follows the image posting title and content guidelines in the [FAQ](https://www.reddit.com/r/travel/wiki/faq#wiki_.22here_are_my_holiday_photos.21.22) otherwise it will be removed without further explanation. **If your images span a number of locations or attractions within a country or city explain where each of them were taken and what we are looking at**. Whilst waiting, please add a comment and captions telling us something interesting about the trip. If you can't add anything interesting please use a dedicated photography subreddit.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "Nice view",
      "Awesome photos!",
      "Woah! Beautiful!!!",
      "I have been to Oman 3 times, I really love it there, especially the valleys.",
      "My husband is going to do a trip like this very soon! Thanks so much for sharing",
      "Yes I love visiting",
      "Beautiful photos",
      "Amazing photos, thanks for sharing.",
      "Excellent.",
      "Great writeup and photos! Thanks for sharing. Oman has been on my cycle touring bucket list for year.\n\nA few questions: Do you have a route map? Is there anywhere you didn't visit that you heard good things about or wanted to? Access to toilets (public or otherwise)?",
      "Great pictures, what camera are you using?",
      "So beautiful. Thanks for sharing.",
      "I miss Oman! I lived there as an expat for 11 years and I assure you it is one of the safest and the cleanest countries I have been too! The people are kind and the friendliest Arabs!🇴🇲",
      "Wow stunning photos! What a trip that must have been",
      "clearly need to add oman to my list!!",
      "Absolutely stunning. Thank you, and godspeed!",
      "Beautiful country. Lovely people.",
      "Awesome pictures! I’ve been following your journey since your post about Mongolia.",
      "Amazing photos dude! Were these taken with a mobile phone or a camera? The quality is awesome",
      "You’re a really good photographer.",
      "Beautiful pictures! \nThanks for sharing.",
      "Loved Oman and the currency is more than a $",
      "Oman's the only ME country I want to visit. It looks great",
      "Oman is really underrated. Even though I have only been to Muscat, Nizwa, Sharqiya Sands, and Jebel Akhdar I can’t wait to revisit",
      "Amazing! Would love to visit Oman.",
      "one of my dream cycling destinations",
      "Not sure what you were trying to prove to who but go off queen",
      "O man",
      "One day I hope to be this cool 🙏🏼",
      "Beautiful people, faces, places, and views. How magical! I'm living vicariously through these images. <3",
      "And OMAN was it cool",
      "Incredible ! Thank you for sharing",
      "These are beautiful pictures! Thank you for sharing!",
      "Oman is a wonderful country, especially Salala. Visited once; truly a gem of the Middle East.",
      "Yemen",
      "Beautiful, adventure of a Lifetime",
      "Such a underrated country!",
      "Great pictures!...so did Dubai a new camp stove?",
      "Wow!! Thanks for sharing those photos.",
      "Beautiful, thank you for sharing!",
      "O man. That's a lot of cycling!",
      "Wow 🤩",
      "Oh man!",
      "Beautiful !",
      "Cool",
      "T'es  français ?",
      "Favorite country in the gulf region, I love Oman!!",
      "Stunning! Thank you for sharing your journey.",
      "Incredible",
      "ty for sharing! these are gorgeous!!",
      "why tho",
      "YOU INSPIRE ME SIR",
      "Great Place and Great People.",
      "O Man! It's is such a beautiful place. Thought it was only desert and a very few sandy cities.",
      "I lived in Sur for five years and travelled all around Oman. Great place to visit.",
      "O(h)man! Those are nice pics!",
      "Wow, this is incredible. I am jealous.",
      "I really enjoyed Oman!",
      "These pictures are beautiful! It never occurred to me it could be a safe place to travel. Thanks for sharing!!",
      "Beyond amazing. I'm so inspired by this.",
      "Is that not dangerous ?",
      "so beautiful. but its giving me The Hills Have Eyes vibes"
    ],
    "comments_lev2": [
      "Excellent post and amazing pictures! Chapeau on your adventure!",
      "Amazing! Did you feel safe throughout?",
      "Just curious, some of the terrain looks rough, so were any problems with the bicycle? Did you get flat tire? I suppose you carry spares, but how many? And duo you have all the necessary repairing equipment always? Thank you in advance for your response!",
      "Wow this is amazing thanks for your post and best of luck on your journey!!",
      "O- man, what a great trip. lol",
      "Incredible stuff. Thanks for sharing your journey! Safe travels",
      "Amazing u/MaxRoving! I often fantasize of such adventures. Question: how did you deal with sicknesses? Were you camping outside daily? What about threats from local wild animals? Any incidents?",
      "Reminds me of Egypt... Did you go there also? \n\nI had an amazing time there and never felt a bit unsafe, despite traveling there on my own. Wasn't cycling, though. 😂",
      "Yes!!!! Where the fishies give you the pedicure? 😁❤️\n\nDid you go to Wadi Shaab?",
      "Yes, I loved visiting Oman.",
      "thats a bit scary tbh 👀",
      "That’s my question, how did you provision yourself? How did you have enough water on you all the time, and were there enough food stops?",
      "Maybe around $700",
      "I just created one (link on my profile) as many people have suggested it, I’m gonna record my journey in Vietnam where I’ll arrive in a week and if I like the outcome I’ll share it 😅",
      "Leica Q2",
      "Lmao sure",
      "I met one Dutch solo traveler who visits Oman every year on her own, she seemed to never have any trouble. But then again she was also taller than most men there 😅",
      "You’re not entitled to see women… If you knew anything about Arab culture, you’d understand that.",
      "You don't see women in pics because in this region, it's disrespectful to take photos of women without their permission. And if you do ask for permission, most of them will say no. When you go to Oman, you actually see a lot of women. At the cafes, restaurants, parks, markets. But walking around in remote areas, no, you don't see many women there. If you do see any humans in remote areas, it's usually a worker or some guy looking for a goat. \n\nAnd as a female tourist, it's totally fine. Super safe, and no one will take pictures of you haha.",
      "Oman is considered the fifth safest country globally! Quite safe for women. In my experience, everyone is very respectful. You won’t see women in photos generally bc 1) they are probably hanging out at home and 2) Middle East has a strong culture regarding privacy. Most women don’t want their photo taken, especially by a foreigner to post online.",
      "It’s kind of weird how instinctively racist and full of assumptions everyone here becomes as soon as someone posts about an Arab country.",
      "Why do you all need to see women in photos all the time? Confused by this.",
      "They have freedom. What freedoms do you think they don't have? In addition to western freedoms, they also don't have to worry as much about rape if they go out to clubs as we do in the west. \n\nI have been there multiple times as a solo woman, and it's fine.",
      "Leica Q2",
      "Do you have any recommendations in terms of transport ?  I do not drive, but how would i get to and from e.g Muscat to Nizwa or Muscut to Jabel - Thank you",
      "camera, a Leica Q2",
      "Why wouldn’t it have occurred to you…?",
      "There is  basically no crime in Oman. One of the safest and most friendly countries in te world",
      "Holy fuck. I can’t believe people like you still exist. Straight out of the 90s with the assumptions. I thought this sub would be filled with people who have ACTUALLY traveled, and not just to Paris and London. Jesus Christ."
    ]
  },
  {
    "id": "1gyamcr",
    "title": "Traveling with friends is a bad idea",
    "text": "Just got back from a trip with a few friends and let me tell you, it wasn't great. We went to Disney which is freaking expensive and not really a vacation I want to play by ear since having a schedule to cram everything in is essential. They were not considerate of being on time and were consistently late/wanted to take hours long lunch breaks even though we were behind schedule. So unless you know your friends can follow a schedule, be considerate, and have a similar budget, I advise against it.",
    "comments_lev1": [
      "The right friends can make a trip fantastic.  The wrong ones, as you found out...",
      "It’s also annoying if you don’t want to be on a schedule and your travel companion keeps pushing it. I’m not saying that one is better than the other, but having travel styles in common is super important. I also have different people in my life for different types of travel. My friends are great at super relaxed all inclusives, while my partner thrives at adventure vacations. I pick the right person for the right vacation!",
      "the way tp travel with friends is to meet up have common events then have separate itis. that way you still get to do your thing.",
      "Traveling with people you don't know really, really well means sitting together before plans are made and making house rules. What to do if:\n\n\\-- Someone is a night owl and someone is an early bird  \n\\-- There are money differences  \n\\-- There are interest differences  \n\\-- VERY IMPORTANT - you do not have to be attached at the hip 24/7. Hours, or even a whole day alone on a group trip is fine. It gets everyone out of each other's hair, pursue the things they individually like, etc.\n\nAs someone else said, it can be really good or really bad. Back in the 90s, I went to Europe with 3 other people. One, I eventually married. One was our best man. And the third one? I stopped talking to them halfway through the trip.",
      "Travelling can break up even great friendships. It’s common. ‘Cabin fever’ sets in",
      "I love traveling alone but I also travel with friends. I totally agree, travel can def ‘make or break’ friendships. I am a planner and what i typically do is send spreadsheet of things to do, and I let everyone add whatever activities they want. Also making it clear that you don’t have to do what’s on the spreadsheet. Lmao",
      "I have a friend who had a bad experience when she was younger. She met someone while traveling and they decided to travel together for a few weeks. Every day my friend would say I want to do this and the other girl would say ok. She thought everything was fine until the other girl sat down and cried publicly because she didn’t get to do anything she wanted to, which she never expressed. So I’ve always had the rule that I only want to travel with people with opinions who speak for themselves and will do their own planning. I’m perfectly happy to spend the day by myself and meet up with a travel buddy for dinner or just see them at our lodging and I need someone just as independent. Still traveling solo.",
      "Traveling with people who have competing priorities to Disney sounds like somehow worse than going to work? 👏",
      "You're on vacation and nagging about schedules.\n\nIf I were them, I'd say you were the negative on the trip.",
      "I would way rather be relaxed than “cram everything in,” which is why it’s best to plan a vacation that isn’t 100% togetherness. In your case, for instance, I’d have said “let’s meet for lunch at x” and also “do y together,” and made that happen. Then you can do things your way and I can do things mine.\n\nOn extended family/friends vacations the usual mo is a few joint activities, plus some “we’re doing x; join if you want” stuff, and then all meet back up at the ranch for drinks before dinner. Depending on the locale, we’ll take turns making dinner or go out.\n\nHonestly, your problem isn’t traveling with friends; it’s failing to plan ahead for different travel styles.",
      "Yeah sorry I would also never go on vacation with you. I do not „follow a schedule“ on my free time and I sure as hell take as long breaks as I want ON MY VACATION. Maybe you are just not compatible.",
      "I think you learned... Just because you are friends, doesn't make you good travel friends.",
      "The problem is you",
      "Traveling to Disney with a bunch of adults sounds like my idea of a waking nightmare .  A friend in that bunch, who requires we \"cram everything in\" on schedule,  sounds like the 10th circle of hell",
      "Yep.  And find out beforehand if their sleep schedule fits yours.  I learned this the hard way with a friend who liked to sleep in ‘till 9, when I’m up at 5.  They also went to bed earlier than I did.   \n\nLive and learn.",
      "Don't force your friends to do things you like.  \nWhen we travel - each of us design their actions and we meet during lunch or places that we all want to see. And then at the evening we exchange our experience.  \n\nThis way you both keep your sanity and friendship.",
      "The problem is really your friends , it's your inability to communicate.  During the planning stages it should've been clear that you have different expectations and the plan should've ended there.  Instead you went on the trip and got upset that your expectations were not met.",
      "Schedules+friends = amateurs “traveling”",
      "\"Having dinner with friends is a bad idea\n\n\nHad dinner yesterday with two of my friends and we argued a lot. So unless you know your friends don't argue a lot, I would advice against it\"",
      "Great friends aren't always great travel friends as they say. I just came back from a trip to Australia with my cousins and it was sooo much more enjoyable than the trip to Cancun with my friends. Unless your friends are able to be on the same page, it's better to travel without them.",
      "Just do your own thing. Ive travelled several times with friends internationally, including one trip which was 4 months long.\n\nWhen we were on different schedules, wanted different meals, wanted to see different things, we'd just say I'm gonna do this, enjoy your thing and I'll see you later. \n\nNever had a problem.",
      "You’re a person that needs structure on vacation. It’s not a bad thing, it’s just how you prefer to vacation. Your friends go with the flow. This is clearly not a match when it comes to travel. You need to vet your friends before you agree to a vacation. I go on vacation with friends, and we’re all casual with loose itineraries. It works out well for us. We also have an agreement where the hotel or house we rented is home base. We agree to meet for meals and all kind of go our separate ways during the day. This way if I don’t feel like something is interesting I can go off and do my own thing without upsetting someone.",
      "Oof. Maybe they were just worried about offending you and had a more relaxed approach to the vacation, but if they agreed to the schedule, they should stick to the schedule. Or at least let you know in advance that they would be doing their own thing. \n\nI traveled with my best friend and it profoundly irritated me how she couldn't do anything on her own. If I didn't want to do something it was taken very personally, so I found myself being dragged along to things I specifically said I didn't want to do. She invited her on-and-off again boyfriend at the last minute and wanted us all to share a room to save money... when I had specifically stated that I need my own space. It was like she couldn't respect the words coming out of my mouth and instead was trying to impose her wants onto me. \n\nI would much rather be alone than deal with all that.",
      "“They wanted to take long lunch breaks even though we were behind schedule.”\n\nIf your idea of a vacation is scheduling out every minute, they probably hated you trying to schedule everything as much as you hated your perception that they were late.\n\nThere’s two types of vacations. One that’s intended to be fun and relaxed, and one that’s scheduled like a middle school with exactly 4 minutes to get from A to B.\n\nIf you’re going to travel with friends, you need to have clear expectations around what type of trip this is going to be, and no pressure if the other party wants to bow out of some of the things because of the schedule.",
      "I think it comes to different styles. People who have rigid schedules on a vacation are the worst.  They can’t just decompress and enjoy the moment.  It just adds stress when the goal of a vacation is to de-stress.  having travelled extensively, there are 20 things a day that can throw off a schedule, you just have to adapt and move forward.",
      "Sounds like OP is the friend you shouldn't travel with",
      "You sound like Sheldon from Big Bang theory, and there is nothing wrong with that, but I am with your friends on this. I go with the flow and chillax at lunch or dinner as well. So maybe make sure they like a schedule as well.",
      "Most people go on vacation to relax from their routine schedules. Don't frustrate your friends who also paid to enjoy their time.\n\nUnless you pay them an hourly wage, your schedule is not an obligation",
      "I'll do low stress less scheduled trips with friends. Like beach trips or to a lake house. \n\nTheme parks, are my solo time. I find a theme park way more enjoyable to go solo or with one other person who is in the same vibe you are.",
      "I've traveled extensively with friends.  Flexibility, patience, and humor are key.  I NEVER would go with a scheduler. To me, roaming, exploring, unplanned stops and side trips, make the trip.",
      "I have friends that are extreme planners for trips. They tend to need to control the entire schedule without really offering their travel companions to speak their mind on how they want their trip to go. Did you ask them what they wanted to do for scheduling, or did you plan it all and then ask them if all was okay? Some friends say yes because they know you won’t pivot plans to their wants either way. \n\nI like to plan as well but on a more broad basis and not a “firm time here” and “ this is too expensive to not do everything on my list or it’s not worth the cost”. \n\nIf you didn’t ask for any of their input in the planning part I think that you should start. Everyone’s time and opinions should be respected. Especially if kids are involved and firm scheduling other peoples kids is a hard no from me.",
      "Meanwhile, in a different post, they are bitching about how you had everything scheduled to the minute and couldn't take a break to relax and enjoy things.\n\nYou need to understand that different people have different priorities, motives, and styles when it comes to vacations/holidays.\n\nYou sound like the type who wants to have an idea of everything that's going to happen. And be very well planned.  That's great if it works for you.  It doesn't work for everyone.  \n\nI personally don't like that type of trip.  One problem is that if you encounter any sort of unexpected delay, It causes a lot of stress.  You need to build in extra time in the day for uncertainty.\n\nSome people have very stressful lives and want to do the exact opposite in their travel.  They want to have downtime.  They want to relax and see & do things at their own pace.  My wife is like that.\n\nMy mother is the other extreme, She's like you and wants every second of every day planned.  I'm somewhere in the middle.  I like to have a few things planned for the day but also be flexible enough to enjoy a stress free day and have time to work around unforeseen obstacles.\n\nThe point is that different people have different styles, and now you know that your friends styles of travel do not sync up with yours.  That's fine.  \n\nThey can still be your friends, Just don't travel with them anymore.  Or if you do, understand where they're coming from and make separate arrangements.",
      "Sucks that you had a bad experience! I’ve been there before and it’s miserable especially if you’re the one who is the planner and trying keep everyone on schedule if there’s a hard schedule you need to follow.\n\nNeed to be on the same page with people that you travel with. I have friends that are great travel companions and I have friends I would never dream of traveling with. Have to be upfront with people and set expectations about the trip to make sure you are all ok with the itinerary.",
      "Speaking personally,  I absolutely don't want to be on a strict schedule on vacation.   I'm on a schedule every day.  I want my vacation to be fun and enjoyable.  \n\nYes, I've been to Disney many times.",
      "I'd much rather travel alone (or with just my family).  I learnt years ago that friends only worry about themselves.",
      "I went to Japan with a group of females friends. They would take 2-3 hours everyday to get ready, and shops at every little store we see lol",
      "I'm the opposite, traveling with people who need to stick to a schedule can be exhausting and take the fun out of it. So consider discussing this before your next trip with potential travel companions.",
      "I would not want to travel with someone who keeps trying to push a “schedule” on me. It’s a vacation, not work.",
      "You’re stating this as some ultimate rule and I just don’t think that’s true.\n\nI’ve travelled with friends since I was a teenager and I’ve loved it pretty much every minute of the way. Some of my best memories in life are from traveling with my best friends.\n\nYou just gotta have similar expectations, and also be somewhat independent. I’m perfectly fine if my friends wanna go shopping and I wanna go do something else, see you at dinner!",
      "People have such different ideas and expectations when traveling together.\n\nSome people are schedule-driven, some are go with the flow.  So you had a mismatch there.  If that happens again, you can split up during the day, and all eat dinner together later.\n\nI've had this issue with extended family vacations.  Everyone is much happier when they can do things their way,\n\nSometimes people take togetherness a bit too far.  You can still enjoy traveling together, but not doing it all together.",
      "It’s a matter of being on the same page about what kind of trip you want to take.",
      "Did they wanted to follow a schedule??",
      "It depends. I travel with a group of 7 all the time. It's three couples, and a single. Our rule is that we try to do one thing together each day, usually in the morning. Then after that, all bets are off. Myself and one of the married guys like to take off and do history stuff, my spouse, for a dude, loves shopping. So he peals off with the wife of the guy I'm out at some weird museum with, and our single gal pal. The other couple kind of stick together and do their thing. Usually visiting  weird record stores or doing something that might be less physically taxing than what the rest of us might be doing. \n\nVery often, we might all stick together, other times, we might all peal off individually. We will often regroup in the evening and go to dinner together or meet for cocktail hour. \n\nYou just haven't found the right group of travel friends.",
      "Trip worthy friends are fantastic. But you don't know who they are until you do a trip with them.",
      "Best to travel with friends who have the same personality as you. For us, we travel with a mother couple and their two kids each March. Our kids get along great and we all have a great time together.",
      "I travel with my friends all the time and we have a blast. Never had a bad experience actually. Traveling with the wrong friends is a bad idea. Traveling with friends that have similar travel styles as you is such a good time.",
      "100 percent it has to be the right friends. Have gone with same group twice so far and been great both times. going on a third next year. my wife has done same and much more a mixed bag due to different personalities.",
      "I’m going to go further here and say, before proposing to anyone, you need to travel with them.\n\nMuch is learned about yourself and others through travel.",
      "My friend and I recently visited Disneyland - we only had one day, so we were trying to cram everything in. We had a fun time, but we wish we didn’t have to stare at the app planning out Lightning Lane times throughout the day.\n\nIf we go next time, I’d be tempted to get the [Premier Pass](https://disneyland.disney.go.com/lightning-lane-passes/lightning-lane-premier/) so I don’t have to worry about scheduling. But then I’d remember it costs $400.",
      "I would suggest going together to share car rental and lodging but breaking up into smaller groups so as not to have to wait on everyone to get things done.",
      "I went with a friend to Iceland one time, and we had a good time, no drama, no issues, but I did get back thinking \"yeah, that's why I travel alone.\"",
      "Never traveling with my friends again, only with my sister cus we have same interests and routine, when im with friends one wants to sleep till noon, other one something else, i am sick of it, ruin my whole trip",
      "I have a friend who criticized the accommodations I booked even though she didn't give me any insight what she prefers. I'm probably a bit of an asshole because I book affordable accommodations that aren't fancy because my view is I'm generally only there for 8-ish hours to sleep and shower, etc. She also criticizes that I travel with a large backpack instead of a suitcase. I was done travelling with her after she started commenting about my luggage. Who the hell cares what luggage I use?",
      "did you talk to them about expectations before you left? did you talk to them about how they like to travel? did you all agree upon on the schedule? when they started to fail the schedule did you confront them about it and adjust?\n\ntraveling with friends is amazing, you just need to communicate travel styles before you leave. personally id hate having your tight schedule. having time limits on lunch? sometimes shit pops up and it’s totally unrealistic to follow a schedule, sounds not fun at all if you’re just rushing through. personally i like to set two or three goals of things to do each day and if you wanna spend extra time for lunch or dinner that’s ok. \n\nyou sound like you’re micromanaging your friends too much. next time when lunch goes over how about just enjoying your friends company and telling yourself next time youre at disney you’ll do those things, or even better why are you so insistent on doing these things w your friends? you can go solo. you cant force your friends to do the things you want to do",
      "did you discuss the schedule before traveling or did you just make it up in your head and expect people to go along with it?\n\nsome people view a vacation as a relaxing time where you dont have to plan anything or do anything.  it sounds like that is not you, but you expected your group to also be like that.\n\nI would also love to find the reddit post from your friends about your clipboard of fun",
      "Why would you go to Disney w friends as an adult? That just sounds awful",
      "You also need to match the vacation to the friends and your actual style. \n\nThose friends would be great on a resort and beach holiday for example where you want to just relax. But people who want to chill and relax wouldn't be great to bring on a hectic Disney trip if you're trying to do everything.\n\nOn the other hand, a hyper scheduler would be a nightmare to bring on a resort holiday where you're planning on just eating, drinking, lying by the beach and swimming.",
      "Traveling with friends *with different budgets* is a bad idea",
      "I love traveling with my friends. You have to be willing to treat them like a fellow human being instead of furniture though.",
      "This sounds like a you problem, not a problem with your friends. Whose idea was it for a group of adults to go to a Disney for their vacation? Strictly scheduled fun meant for children, and paying out the ass for it. Can’t imagine why they weren’t into following your itinerary.",
      "The thing that everyone has to realize on a trip like that is that traveling together doesn't mean you have to do everything together. If you want to stick to a schedule and they want to relax, that's fine. Split up and do your thing and they can do their thing.",
      "Warning : \n\nDo not travel with friends who have photography hobby",
      "We only travel with people we can yell at. Our kids.",
      "Or may be you need calm your ass down and go with the flow at times?!\nWhat’s the worst that could happen if you miss out on a ride?! \nYou still get to hang out with your friends and enjoy the moment of being on a trip with your friends. So, may be chill out a bit?! Not everyone is going to be match the frequency you are in. Especially when it’s a larger group.\n\nThe point is while I understand what you’re saying, it is important that frequencies match. Some people like to be on schedule, some people are more laid back and thus it’s important when you’re running on tight schedule. But if they’re your friends, and the inconvenience isn’t that too much, may be find a middle ground and just enjoy the time out with your friends. Does it really matter if you miss out on a few rides/experiences out of the hundreds that you planned to do?! Don’t get me wrong, I am most certainly like you who likes to have a plan and stick to it. But something that I’ve learnt from my experiences, is that when you go on trips, specially if it’s something like Universal or Disney, things deviate due to N number of reasons and you just have to deal with it. Why do you have to stress about it! \n\nBut for future trips, now you know whom to go with. Some people might still make the cut! Haha.",
      "Yeah I don't think your travelling styles match. I also wouldn't want to \"cram everything in\" so I empathize with your travel buddies.\n\nVacation is about fun and it sounds like you guys just have different ways of doing that on vacation.",
      "Were your “friends” under 12 yo? Because adults at Disney with other adult friends is just weird.  The Disney money pit can F itself. Ridiculous what they charge for a “magical experience”. Go get more value from your vacation on a cruise, Europe, anywhere…",
      "I read “cram everything in” and assume shitpost unless people actual travel with this mindset?",
      "Been travelling with my sister-in-law and her husband every year the past three years and it’s been great!  My wife does 95% of the planning (which she enjoys and is really good at) and the three of us are all very happy to go along with her schedule.  We know how much effort has been put into things, and rarely have we had issues.  Funny enough, the only time we get a little worn out, is when we don’t really have a plan.",
      "I think it's not that your friends are bad travellers but that there was no communication around people's expectations and needs. Not everyone wants to follow a set plan on holiday. \n\nI once travelled with a friend who had everything planned minute by minute and it was the worst trip of my life. Your friends are probably saying never travel with someone (you) who is so square with zero adaptability.",
      "I wouldn't say the most important thing is whether or not your friends can follow a schedule but rather that you're all on the same wavelength on that trip. Sometimes I'm feeling a spontaneous trip and don't mind travelling with people who are quite lax but other times I do want to be more regimented and have a more rigid itinerary. As long as we're in agreement about the type of trip we're doing then it's fine. Also, sometimes we split up and rendezvous once people have done what they want to do if we cant agree which is also fine!",
      "Holiday with friends, travel alone. That's the rule.",
      "I have traveling friends and non traveling friends for that exact reason. It's good to test it out, now you know. 😁",
      "This is why I travel with my wife only. Usually on the same page, have same fitness level, eat the same foods, etc.",
      "Sometimes when traveling with “friends,” you find out who they really are. Bill Murray once said, “If you have someone you think is the one, take them and travel around the world. Buy a plane ticket for the two of you to travel all over the world, to places that are hard to reach and hard to get out of. And when you land at JFK and you’re still in love with that person, get married”. This is an extreme example, but I feel it can apply to friendships, too. Some folks are good at hiding their true nature when most things are copacetic. Small differences like scheduling aside, you can find out who someone truly is under the stress of being in a foreign country, how they treat people who are different from them, how they treat you in unfamiliar environments. Speaking from a few experiences.",
      "Yeah, I think the important lesson is to make sure friends are compatible for travel. Not every friendship has to be travel-buddy. \n\nWe like to have a schedule but we have friends who feel like “I am on vacation and I won’t be rushed). If we travel together (not often) we make sure that our plans are independent - if they want to take 3 hours for breakfast, good for them, but we’ll be off doing something.",
      "I just did Disney earlier this year with my friends. I made sure everything everyone wanted to do was on the schedule with a couple of rest days. I told them, I don't care what they do, but don't complain to me if they miss something. Everyone had a blast and got to do the things they wanted to. Just making sure. Everyone understands the schedule, including the scheduler, helps a lot.",
      "Conversation ahead of time is the key here\n\nI spent a week with a buddy and within the first couple hours I wanted to kill myself",
      "I went to the Philippines with 5 other friends for just over 4 weeks. Was fantastic. A few quams but nothing major. We'd split up sometimes and all had local sim cards so we could communicate. We only had right schedules when we would book a boat for a few days or scuba or swim with whale sharks etc. My Philippino friend planned pretty well everything and having a \"local\" helps so much. \n\nHopefully your next experience isn't so bad. I traveled a lot and have a few days booked only then find things to do once we would talk to locals and other tourists. Some of the best trips are ones with minimal planning.",
      "Yeah, it depends. I had trips where I had a great time and trips where I had a bad time. I think the worst is traveling with just one friend. I had a Cambodia/Thailand trip with one of my beat friends and I didn't really enjoy it. At one point we just did our separate thing.",
      "Idk I’ve traveled with friends and it was fantastic. We wanted to do most of the same things but if we wanted to do different things or one of us just wanted to chill at the lodging, we went our separate ways for the day.",
      "This is why obe should set ground rules before arranging a group trip",
      "I travel with my best friend sometimes and they are the trips I’ll remember for the rest of my life 🤷🏻‍♂️ just need to be on the same wave length",
      "We have friends who the wife is  always hint at joining us on a vacation. I changed the subject all the time as I know we would not make good travel partners. We travel a lot, they don’t and based on stories they have told us of travel with other friends, they have to be hand fed all the plans and booking info. Also when they don’t like said plans they get moody and grumpy. They also won’t make plans of their own and want to do everything together.  I finally told her I value her friendship too much to ruin it by going on a vacation with them.  She was a bit put out at first but then I think she realized the sentiment sincere.",
      "We do group trips every other year. I'm from the USA but live in Australia, and some our friends are now mutual as they met at our wedding in Hawaii and really hit it off, so we know who gets along well. \n\n  \nWe have a good sense of the financial \"comfort\" of our friends (house, car, travel and dining habits), and how they behave when things like the dinner check comes, etc (do they forensically split it up, or simple even split). So based on that, we have a feel for who can afford what. We've done this in Hawaii, Costa Rica, Thailand, Mexico, Bali. \n\nWhen we come up with a trip, we usually start with floating a concept, see who's in, and set a budget. Example: \"Thailand, Private Villa, 10 days, November, $300pp/day + your flights and transport, who's in?\" I usually include a couple of potential villas or resorts. Villas with private chefs work well to address dining restrictions, allergies, kids, etc. \n\nWe are leaving soon on a one-month holiday, finsihing in Cancun with some of our USA friends. We have some solid plans, which include dinner each night, and shuttles (airport, fun parks, shopping, etc.). Our friends know if they want to go with us to those things, then thats the time, if they want to do their own thing, cool. Everything else is just \"relax\". This works well for resorts and villas.\n\nI would never do a group trip to Disney or anything like that.\n\nIf you find yourself waiting on your friends when you're home, if you get frustrated with them over splitting checks, etc. They probably arent travel friend material.",
      "You do understand that you have free will to do whatever you want, right?",
      "Sorry your vacation wasn’t what you were hoping for. This is definitely the biggest perk of traveling alone. There’s no “wrong” way to do vacations, but there are definitely wrong people to vacation with. If your general styles (structured or not structured) don’t align, you’re in trouble. But even if you’re aligned there, you need to be interested in the same activities, etc. or all be willing to split up as needed so everyone can get what they want from the trip. Hope the next one is better for you!",
      "I love travelling with friends, and you all really need to be on the same page with how you want your days to go. Whether it is committing to a schedule, or being more loose, everyone should be on the same page to make it work.",
      "I’ve traveled with family, friends, and SOs, and traveling alone will always beat them. You’re on your schedule and terms. I know it’s not for everyone and that’s okay but if you’ve never tried it I recommend it.",
      "Traveling with multiple people, even family and good friends, add more challenges and drama.\n\nI find this be true for any trip longer than a weekend.",
      "You have to have the same travel style for it to work",
      "depends on if you are not such a huge group, i can bet that’s too chaotic and somebody will always be running late. but if its a small group, then maybe… i once went on a 7 day cruise in the Mediterranean w 3 other girls… considering we all had to travel to barcelona, hotel room for getting there a day before cruise, cruise itself, private tours that cost 700eu for each stop (this was in 2016?) and hotel to stay another night after cruise, needless to say it wasn’t a cheap trip but i think if i would do it again i’d want my own room… definitely being together 24/7 literally lol was driving me insane",
      "One thing i can't recommend enough before planning a trip is to actually talk about what everyone expects from the trip. \n\nKnow ahead of time how planned or spontaneous people like to be. How much money they expect to spend. How much time is going to be spent together. How much rest time vs active time you want.\n\nAdditionally, ask everyone what their \"can't miss\" experiences are. If that $200 meal at a Michelin restaurant was the reason why someone wanted to visit that city, they're  going to be upset if people argue about the price when they get there. Knowing ahead of time means it could have been budgeted for or someone who didn't want to spend that money could have made different  plans for themselves that night.\n\nAt the end of the day it's everyone's vacation and no one likes to feel like they can't do what they want to on the trip they've been looking forward to.",
      "How many people did you go with?",
      "My wife and I found it vital to set expectations from the beginning. We love traveling with people, but we’re super up front about everything from the beginning. Before mentioning the idea to someone, we establish the dates, tell them where we’re going, and the things that WE will do when there. We have some must do’s, some want to do’s, and a little flexibility.\n\nIf they want to join, great, if not, we’ll have fun without them. It’s important for them to understand up front what they’re getting themselves into if they want to join US. \n\nOn the flip side, if we’re joining someone, I want to know what their plans are. If they just want to go with the flow for ~7 days, then set low expectations as to how much or what you’ll be doing.",
      "The key is similar budget, similar interests and give each other space every day. Like, don’t have to eat every meal together.",
      "Not all friends are traveling/vacation friends unfortunately!! Personally I don’t like to travel with anyone but my partner because when you travel or vacation with other people too many people gets in the way! Lol",
      "It can be hard traveling with your mate let alone with another couple or group of friends.At this point , I value my friendships too much to ruin them by traveling together.   If you do it, lower your expectations, be patient, and be willing to go with the flow as something even as simple as choosing a time and place to eat can be difficult.",
      "It doesn't really have anything to do with traveling with friends in general. It's more about traveling with people who are travel compatible.\n\nSome people love a schedule. I *abhor* one. \n\nNo offense OP (none at all, truly!), I would have left you to your schedule and met up later. \n\nI have friends that I don't travel with because they want to plan everything out ahead of time and deviating from any plans is the gravest of offenses. \n\nSome of the best memories of my life come from spontaneous side adventures while traveling. \n\nThe inner thought, \"Oh shit, that sounds cool.\" rarely fails me while traveling.",
      "I think the challenge is Disney. It would work if you’re on a beach trip or eating your way through Italy",
      "I've travelled with friends a few time. I've learnt that you have to know their travel style well before - there WILL have to be compromises from both sides (key being both).\n\nI once did a 5 week trip with a friend - the last week was definitely testing us but we got through it - we've never travelled together again though. I've got 5/6 days with a few other friends regularly and it's always been great.",
      "Nah, traveling with the wrong friends is a bad idea. I went to Spain with 2 of my sisters and my best friend and we had a blast.",
      "Different friends, Different types of trips. I have adventure cat friends that I can do international backpack and go travel with, and I have indoor cat friends who would like to sleep till noon and a beach and cocktail every single day. Comfort levels also matter, you have to know if this is a person who can sleep next to you on a bus for 10 hours or if the person you're traveling with just cannot be inconvenienced by anything lower than a 3 star hotel. You just have to do the right trips with the right people. Also, always be willing to break from the pack and do your own thing. I have had multiple vacations where I was like 'OK I will meet you for dinner' and just went.",
      "in everyone’s defense, Disney is extremely stressful and a horrible vacation spot haha",
      "There is only one friend I travel with internationally-I simply choose not to travel with friends. I like my own time, my own space and if I am spending $, I want to do what I want to do and when I want to do it. And I HATE not doing some excursion because a friend does not really have the $, so I end up paying for it or their budget is just tight in general. So, ALL (and I literally mean ALL) my friends know, I am not a team player when it comes to traveling. Do you and let me do me. If you don’t want to join in an activity-not a problem-and respect it when I say no, I am doing ABC. Besides, I can only take “company” for so long-lol-then I want to be left alone in silence. lol Hey, at least they know the deal and I keep it 💯.",
      "It’s important to discuss expectations, itineraries, and schedules before traveling with anyone.",
      "Once you start traveling alone, it’s hard to go back \n\nYou for sure have to vacation with people who 1, vacation like you 2, have the same budget as you",
      "After travelling with life-long friends,  I’d be inclined not to do it again.  It took a while for me to forget the pent-up stuff, after the trip was over. Their little annoying idiosyncrasies.  We all have little annoying ways. I’m pretty confident they felt the same way about me. There wasn’t enough time apart scheduled. We should have split up more often for some alone time.\n\nI would prefer to just travel with my wife or our dearest, closest, other family members who we know super well.  I’d say my list has only 3 people on it who I’d travel with.  Wife and 2 others in the family.  \nMy wife and I are so tuned-in, we travel like 1. She’s up for anything that I want to do. I plan and make time for things I know she’d like to do.  Its great.",
      "I live 15 miles from Disney and don't want to go to Disney with friends.",
      "Tracked with my uncle it was awesome in the sense that he was always up for seeing things and waking up early and sleeping late and walking and getting lost. It was all good. It’s hard to find people that want to explore.",
      "People have different travel styles and that's okay. Don't travel with someone before discussing ahead of time exactly what your expectations are.",
      "I prefer trips with friends to have a few major things we all do together and the rest is free time for all.  Hang out or not, and then have a few things planned. I find the fewer the expectations, less drama.  \n\nI also agree, similar budget is imperative!  And similar taste in food. If your friend likes to eat like a 5 year old and live in chicken nuggets and you prefer dim sum, it's not fun either.",
      "People always talk about taking vacations with friends and I don't understand it all. Maybe a cruise where if they sleep until noon you can still do whatever you want. That's about it.",
      "Just because you want a schedule to cram everything in doesn’t mean they want to do the same. \n\nWhy can’t people go away together and do whichever bits they want to and not stick to someone else’s itinerary?\n\nWhen my friends and I go away we have a vague outline of a plan but people do what they want. \n\nSpending all that money on a trip that’s supposed to be fun and then it being run like a boot camp sounds miserable.",
      "I could hardly wait to be rushed out of something I was enjoying, because it just didn't fit into someone else's schedule. When I go on vacation, I am looking to enjoy myself and relax. If I was looking for a schedule, I'd check the email my employer sends it to each month.",
      "You should've put your foot down. If their style of travel does not jive with yours - should have suggested going separate ways during the day and then meeting up for dinner to share your experiences.",
      "Maybe you are a turd?\n\nMaybe they are turds?\n\nEither way.  Group of turds",
      "when you said you and your friends went to disney you mean a couple families with kids, right? Like not just a group of adults choosing disney as a destination",
      "Have you thought that maybe you were the one who was bothering them ?",
      "The fault was going to Rip-Off Disney.",
      "You’d probably get more compassion in the r/WaltDisneyWorld sub. I’ve been to Disney twice as an adult and I wouldn’t consider it a vacation. Locals will talk about how they’ll just stop by the parks for a few hours and wander…but they’re locals and it’s not a once in 10 years or once in a lifetime event.\n\nAll that being said, a lot of people in here are going to give you crap for “nagging” about being on time or on schedule while on “vacation.” But again unless you’re super wealthy or live locally…a trip to Disney is not a “vacation” where one goes to relax. You go there to ride rides, experience stuff, and get shit done. If you’re not…then why are you going?\n\nIt sounds like your and your friends had different expectations about the trip. Me personally, I’d give them one chance to be late or off schedule…after that they can meet up with me in the park. Sorry you had to come to this realization with your friends but again I think setting expectations for a trip like Disney, up front, would have saved some headache.",
      "Traveling with YOUR friends is a bad idea. Traveling with mine is great."
    ],
    "comments_lev2": [
      "From OP’s “we had to be on schedule”; “you have to schedule to cram everything in” description of themselves, I’m guessing the friends will avoid future trips with them like the plague, so it should work out nicely.  ",
      "Absolutely this. I have a great set of friends that occasionally travel internationally together and we all are on the same page about what we want the trip to be about. Most importantly, everyone respects the schedule and plan.",
      "100% \n\nI have a couple of friends that are great travel companions and truly make trips better. But the wrong people do make a trip much worse, unfortunately had that happen too",
      "Mmmm. I have rarely had a good friend who didn’t annoy me to no end on a buddy trip.",
      "You’d probably get more compassion in the r/WaltDisneyWorld sub. I’ve been to Disney twice as an adult and I wouldn’t consider it a vacation. Locals will talk about how they’ll just stop by the parks for a few hours and wander…but they’re locals and it’s not a once in 10 years or once in a lifetime event. \n\nAll that being said, a lot of people in here are going to give you crap for “nagging” about being on time or on schedule while on “vacation.” But again unless you’re super wealthy or live locally…a trip to Disney is not a “vacation” where one goes to relax. You go there to ride rides, experience stuff, and get shit done. If you’re not…then why are you going?\n\nIt sounds like your and your friends had different expectations about the trip. Me personally, I’d give them one chance to be late or off schedule…after that they can meet up with me in the park. Sorry you had to come to this realization with your friends but again I think setting expectations for a trip like Disney, up front, would have saved some headache.",
      "I travel with my bestie and we have great memories together.",
      "agree, travel compatibility makes all the difference. Matching the vibe to the person saves so much stress and keeps the trip fun for everyone",
      "Yep first thought here. OP’s friends aren’t wrong, just have a different travel style. You just gotta make sure you travel with people who have compatible styles or be willing to compromise. ",
      "True but for Disney you absolutely need to plan ahead if you want to do everything. If you want to just drink around the world at epcot then fine but if there are rides and food you want to try, you must plan.",
      "I agree as long as the this is discussed and agreed to before hand. Some people don’t want to do things on their own.",
      "This is the way! Common events but also be able to do your own thing.",
      "I'm not sure I could stretch going to Disney as \"travelling\" lol",
      "Yeah; me and my best friends didn’t end up going on holiday together for about 18 years; just through circumstance, and we did joke this could be the moment that ends it all.",
      "I feel like cruises are the safest bet for traveling with friends. I can't see much going wrong with that",
      "When I would say I was going to go do xyz on my own since they were just sitting around, I would hear \"no! We have to stay together!\"",
      "I think I would self aware enough to notice on day 3 or 4 that we are doing what I want to do every day and ask what do you want to do today or what's on your list?",
      "Haha this made me chuckle!",
      "Exactly what I was thinking.",
      "Completely agree. I grew up with Disney and it is literally the most play-it-by-ear place you can find. I'd go crazy if I was with someone nagging in my ear about a schedule... at Disney. Like...okay, this ride has a 2 hour long line...should we just skip it all to keep on your schedule?",
      "Normally I'd agree but Disney is not that type of trip. It's designed to where you're forced to be extremely punctual if you wanna do anything besides chill at your hotel",
      "At places like Disney you actually need a tight schedule. I hate Disney for that reason.",
      "100% agree.\n\nI absolutely do not want to go on a vacation with someone who will say things like \"having a schedule to cram everything in is essential\" without a hint of irony.",
      "Have you ever been to Disney World? It really is a place that runs on schedules.",
      "Hard disagree. If we agreed to meet up at a certain time and hit the ground running, don't show up 30 minutes late and then still not be ready and want to grab food first.",
      "I think my failing was planning with friends who aren't considerate of other people's time. Obviously it's not a big deal in real life, but during a vacation, it does matter.",
      "Your way isn't better though, just different. Travel compatibility is the issue and they just didn't match up for this trip.",
      "I mean, who gets up at 5am besides people over the age of 80 and farmers? lol",
      "I got sick with pneumonia on a trip and was awake all night because of this. When i finally got to sleep it was already sun up. Months later i hear via via my friend said i was boring and \"wanted to stay in the hostel\"  \n\nBrutal 😢",
      "Haha in this case my friend you were the one supposed to warn everyone you like to be up and gone by 5-6am because this is very unusual by general standards - contrary to your friend waking up at 9 . It’s not bad at all, you just need to tell people in advance.",
      "Apparently they all preplanned said schedule together",
      "Ding ding ding",
      "I asked about splitting up and they didn't want to, so I was the one making all the compromises in the time wasting. \n\nAlso if someone invited their own again off again bf last minute and wanted to share a room I would have a come Jesus meeting.",
      "Which I get and can adjust and account for. But what if the thing throwing the schedule off is someone just purposely not following the agreed upon schedule or being consistently late.",
      "I do like comic books and trains ... I should amend it to say traveling with certain friends is a bad idea. I should have vetted better and given a quiz with questions like \"if someone says to arrive at 7 am, what time should you arrive?\"",
      "Lesson learned for sure! I know it seems petty but if plans aren't followed it can break a vacation, and travel is too damn expensive for all that",
      "probably need new friends if all of yours only worry about themselves",
      "I was thinking this the entire time, that I would rather have done a solo trip!",
      "I like this advice. Travelling together, but kinda separate when it makes sense",
      "I could understand if it was a deviation that occurred out of our hands or if plans had to change because something made more sense in the moment. My main issue stems from agreed upon times that are just disregard last minute because they don't feel like arriving on time or sticking to a basic itinerary. If that's the case then just make my life easier and say \"actually let's split up\" instead of still wanting to stick together",
      "I 100% travel with that mindset. I only get a few days of vacation a year, and then it's even more rare to have money to do something during those days. I can sleep and relax at home for free.",
      "Your wife sounds like a dream! I don't like making schedules but feel they're necessary to maximize a trip, so if someone else took the time to do that and all I had to do was show up and partake, it would be much more relaxing. Definitely let her know how much you appreciate her efforts!",
      "Yes,. I'm learning that not all friends are travel friends. Should test it out on a small weekend getaway first!",
      "I travel with in laws and family and never had an issue, but they're all incredibly punctual and considerate. So it all comes down to personalities and that being magnified when on vacation.",
      "100% this. I definitely should have been like guys, seems we want different things, I'm gonna follow the itinerary but let me know if you want to meet up later or something.",
      "No lies detected. Could've had a European trip for the cost, but I had never been before so it was still nice for my inner child to experience."
    ]
  },
  {
    "id": "1gy6wip",
    "title": "Is New Orleans in the USA walkable?",
    "text": "Hi everyone,\n\nI was wondering if New Orleans in Louisiana is really walkable. I’m from Europe and I don’t have a car or driving licence. However, I’m already planning my next trip for next year and I haven’t picked up a destination yet. Also, I’ve never been to the US so this would be my first time.\n\nThank you everyone for the help",
    "comments_lev1": [
      "Depends. If you’re just staying in the French quarter and around then yes. If you want to get around the city like Audubon park, lower garden district or Bayou St John or Treme it’s not the most walking friendly and in the summer it would be unbearable. There is the street car which can take you to a good amount of places. But Uber and Lyft are also readily available and easy to use",
      "Yes. You'll only need a ride to and from the airport.",
      "You might miss the most New Orleans thing ever. They built a beautiful new terminal at MSY and forgot to build the road that connects to it. By far the coolest city in the US.",
      "Yes assuming that you’re planning on sticking to the main tourist areas and aren’t trying to get to the suburbs.",
      "First of all, thank you for making your first trip to US somewhere that is not NYC or LA. Nothing wrong with those cities, but there is so much more to our country.\nThe French Quarter is very walkable, and if it’s your first time in the city you’ll be busy enough there you won’t need to leave.",
      "Yes, but also Uber is very cheap. I went last year, and we walked 75% of the time, and then used Uber the rest when it was a bit too far to walk.",
      "New Orleans is very walkable.  It's flat, and if you are careful about your surroundings, you can walk to many parts of the city.  When I stayed by the CBD, I would walk over to the FQ, and down St. Charles Ave or Magazine St to the Garden District.",
      "Very walkable! You might need to Uber between neighborhoods if you want to see some things away from the more populated areas but it’s one of my favorite cities to walk around.",
      "Rule of thumb: if a city in the US is popular with Europeans - it’s walkable.  Except for LA, Orlando but even they have walkable parts",
      "Yup, definitely.",
      "Walkable if you're staying around the main area. We didn't stay in the French quarters but it was only a 10-15 min walk which is nothing for you Europeans. They have buses but we didn't really use them. Can always rent a bicycle too. Uber is available if you're under a time constraints and need to be somewhere faster. \n\nAlso if you plan on seeing a plantation or alligator boat rides. Those companies that do them have shuttles and so pickups at multiple locations around the city.",
      "Yes, this is the reason the city gets so many big sporting events. Everything fun is close to each other.",
      "Yes I lived and worked back there in 2006/07. Lived in the Quarter and worked in the CBD. I walked to work and back. It was strange for my colleagues 🤣",
      "Yes! When I went I couldn’t afford accommodation in the French Quarter so I stayed in Hollygrove and took the street car into the Quarter. It was probably about a 45 min commute but it is beautiful and there’s a lot of great people watching to do. Once you’re in the French Quarter most everything is in walking distance",
      "Public transit in Nola was surprisingly cheap and convenient. Get the Jazz pass and you can ride the bus and tram wherever you need to go.",
      "Yea it’s fairly walkable. Boston is another good walkable area",
      "Can’t you also use uber?",
      "Be careful taking taxis. I always took Uber because a taxi tried to scam me really hard. \n\nIn general yes, it's a good place to walk.",
      "As a tourist, the downtown is indeed walkable or doable by public transport. You can even use a train from the city center to other cities.",
      "Just be careful where you go. The murder rate in New Orleans is much higher than what you are used to in Europe. For comparison, the city is less than half the size of Marseille and has about 4 times as many murders.",
      "The French Quater is walkable but I will say outside of that transportation will be needed. I stayed in a airbnb away from the \"action\" and the journey to FQ was laborious. Public transportation was lacking imo. I highly recommend staying in the Quarter or as close as you can.\n\n\nI was also surprised at how many sidewalks away from the tourist area were crumbling...horribly. ",
      "Yup, I spent a week there and only used uber to and from the airport. Otherwise walking and public transit worked perfectly. I highly recommend getting the Le Pass app for transit.",
      "Yes, extremely, but be cautious.  I absolutely love New Orleans, but it is an area where wandering off in the wrong neighborhood can land you in trouble (the site of my extremely polite mugging) and there are areas you shouldn't be walking in late at night.  Generally the locals will tell you where they are though.  I was there solo one time for a job interview, asked the bartender if it was fine for me to be walking back along Tchopitoulas back to my hostel in the Garden District, and he was like \"um... no.\"\n\nBut the main tourist areas are plenty walkable particularly during the day, and the streetcar connects the Garden District to the French Quarter, which is handy.\n\nI wouldn't go during Mardi Gras.  It's absolutely insane.  And particularly as you're from Europe, don't going during the summer.  It is like walking on the surface of the sun if the surface of the sun were humid.\n\nIt's a fantastic fun city though, and the music comes from everywhere.  It is not uncommon to have buskers on the street with separate people dancing in the street to the buskers.  I'm glad it's getting some life back after Katrina, since seeing it mid destruction (my relatives used to live there) was awful.",
      "The French Quarter is very walkable. The Garden District is as well and both are connected by a streetcar. I did not go to Frenchman St, but I think that area is walkable too.\n\nFantastic city and awesome food everywhere.",
      "Bring a gun",
      "It is walkable but not always safe. Be prepared to take uber.",
      "Very dangerous city. If I were you, I would do some serious research, New Orleans is not safe in this day and age.  For instance. Just had a deadly quadruple shooting and that is just one of many. Consider going someplace else!\n\n  \n[New Orleans French Quarter shooting suspect wore ankle monitor](https://www.wdsu.com/article/french-quarter-shooting/62981193)"
    ],
    "comments_lev2": [
      "Thank you! How is also the public transportation in New Orleans?",
      "Thank you! Also, how many days do you think I need to visit the city?",
      "Isn't there a bus from the airport to downtown?",
      "Really, no car needed? I guess it is assumed you are staying in the downtown?",
      "Are the terminals also connected by a shuttle?",
      "Thank you! I was also thinking to join Mardi Gras if I have the chance, hopefully it will be in any tourist area",
      "Thank you!",
      "Walk in Uber out is always my motto.",
      "From where I from I don’t know people who have visited it because they were going in bigger cities such as New York. In my case, New Orleans is really known also because of the media",
      "One suspects the weather has a lot to do with it",
      "For my style of travelling I also like walking through the streets instead of taking a cab every five minutes. I enjoy travels more when I can wonder through the streets",
      "This is correct.",
      "Completely blown out of proportion. Check out r/asknola for real insight regarding this concern."
    ]
  },
  {
    "id": "1gybwsf",
    "title": "Sunny autumn day in Venice",
    "text": "",
    "comments_lev1": [
      "Hi /u/Budget-Egg8555, Thank you for your submission. The mods have been notified and it will be checked in due course - there's no need to message them.\n\nIn the meantime please **ensure it has the country in the title** and follows the image posting title and content guidelines in the [FAQ](https://www.reddit.com/r/travel/wiki/faq#wiki_.22here_are_my_holiday_photos.21.22) otherwise it will be removed without further explanation. **If your images span a number of locations or attractions within a country or city explain where each of them were taken and what we are looking at**. Whilst waiting, please add a comment and captions telling us something interesting about the trip. If you can't add anything interesting please use a dedicated photography subreddit.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "Very cool"
    ],
    "comments_lev2": []
  },
  {
    "id": "1gy9moy",
    "title": "Disappointment from romanticisation and modernity?",
    "text": "Does anyone else just have this sense of slight disappointment in every location they travel to? Like I had a great time, did amazing things, met great people and ate awesome food, but it is never as good in reality as in my head?\n\nI've struggled with this for years and I've come to realise the problem. It's not a place I want to visit, it's a place in a certain time that's been romanticised and in fact, no longer exists. The modern world has taken much of the beauty and individuality from almost everywhere now. \n\nI know there's no solution, but wondered if I was alone in this and either way I just wanted to get it off my chest. \n\nI wonder how many places remain that I've perhaps romanticised. I know some of them do, now I need to point my travel towards those. \n\nIf anyone invents time travel, hit me up. ",
    "comments_lev1": [
      "Nature never disappoints.",
      "One of the nice parts about travelling is exactly that how much I try to picture a city/place to be beforehand, it’s always way different and unexpected things impress me. ( especially with exotic or uncommon places )\nI’m happy for this , imagine it’s exactly how you pictured it to be.. that would be boring",
      ">It's not a place I want to visit, it's a place in a certain time that's been romanticised and in fact, no longer exists.\n\nAre you certain that the place you want to go to ever existed at all? The Welsh have a word for what you might be experiencing:\n\n*Hiraeth: A homesickness or nostalgia for a home or place you cannot return to, or that never was.*\n\nIt is possible to be homesick for a home you never had.",
      "I kind of know what you’re talking about. A lot of the world has been globalised. With that being said, when you start travelling more off the beaten path, that sense of wonder/singular ness will be present.",
      "Since forever, writers have attempted to make their travel stories interesting, and they tend to exaggerate. it's not necessarily \"romanticization\" but just storytelling, and an interesting story is often better than the mundane reality - or is it? An element of reality is your attitude about it.",
      "No, because culture is not static. I do not want to visit a place that is stuck in time so I can just be a voyeur of non-modernized locales. \n\nLook- I think I get what you’re saying in a sense. Globalization absolutely homogenizes cultures. And there are absolutely many other negative impacts as well which are beyond the scope of this thread. However, if given the choice between a more isolated but culturally pristine locale versus a less isolated and more homogenized place that has more opportunities for its people due to modernization, then no, I would not want to go back in time.",
      "Modern life is alienating. I think you’re perhaps looking for less of that when you travel and just not finding it or finding the sense of alienation goes with you.",
      "This sounds like a you problem.",
      "I think this is a really important observation. Very often, tourists decide to visit a location because of a literary link, for instance, Long Island and F. Scott Fitzgerald (The Great Gatsby), Columbia and Gabriel García Márquez, Cuba and Hemingway etc. When tourists finally visit the site in question, they're often disappointed because it hasn't been 'preserved in aspic'.  In other words, it's moved with the times and the features that made it special are now diluted, sometimes to the point of non-existence.\n\nFor what it's worth, I think it's useful to manage tourists' expectations. Traipsing around an African village full of mud huts might be picturesque for tourists but the inhabitants are understandably likely to desire better conditions. Tourists should be made aware of this dilemma. The 'trick' is to provide a tourist experience that is reasonably authentic while simultaneously increasing the quality of life for the people living at the tourist site.",
      "\" ...it's never as good in reality as it is in my head.\" Have you considered that the root of the problem may be in your head?  No place, or person, or event is unmixed perfection. Even the most perfect moment will pass very quickly. The key is to find perfection in the moment, focus on the beauty in front of you. Travel is a great way to dislodge us out of our existing headspace and appreciate things in the new light.",
      "No, because you really can't get the proper cultural experience from vacation or a short trip unlike you would if you spent extended period of time in a location",
      "Maybe it’s because social media has broadcasted everything for us to see and almost experience without actually experiencing it. \n\nAlso because as you get older, the world gets duller. Your senses literally lose strength",
      "Nope. Literally never had this problem. Every place I visit I enjoy and find something to like about it. And even if I don't like it that much I find the bad things interesting too. Just drop your expectations and appreciate places as they are.\n\nEdit - Edinburgh Scotland is one place that surpassed any expectations.",
      "Can you tell us a bit more of what you fantasize when you travel? What are you expecting that these places don't do for you?",
      "Maybe you should try not overthinking travel and trying to fit it into some ideal.",
      "A more stoic approach to travelling might help. Accepting what is outside of your control and focusing on what you can control. There is so much beauty in travel when you can let go of any preconceived expectations and just focus on the experience in the now. Not everything has to be fantastic. Focus on the small things that bring you joy. Acknowledge things you don't enjoy, but don't let them linger for long.",
      "Sounds like a you thing, and I don't mean that to be rude. Travel with fewer expectations. I learned that early travelling to more off-the-beaten-path places. Also don't let external stuff shape your opinion of a place. Gotta see yourself. \n\n\nI'd suggest more nature, more hostels. Might help. ",
      "I mean, yeah, to a degree the places they used to be never existed, and part of me gets sad when I visit places like, say, Venice, which now has throngs of tourists and modern chain stores…. \n\nBut then I research the history and realize that during the gloriously romantic past, there were livestock like cows pooping in the streets, winters were damp and miserable without central heating which meant buildings were rife with mould, people dumped their refuse in the stinking canals, and because it had to get exported to the mainland due to water shortages, they did their laundry only about twice a year. \n\nSo I’ll take the present, thanks.",
      "Quite sure romanticizing a place you've not been to is a century old phenomenon. Ive also felt that way but thats why i keep expectations low. Pleasant surprises are often much more memorable than seeing something that has been hyped.",
      "I don't know, San Gimignano is pretty nice",
      "Generally, my expectations are not super high when I travel. Have I seen a bunch of instagram posts? Yep. Do I know that somebody else's Instragram posts are going to be different from my personal reality once I get there? YEP.\n\nI'm usually not disapointed when I travel. Quite the opposite actually.\n\nThe one time I was really disapointed was when a co-worker told me that Langkawi, Malaysia was amazing. Turns out he and his wife stayed in a 5-star resort and didn't leave it. Amazing, sure! My wife and I stayed in a 3-star hotel there and explored the entire island, and while we had fun, we were a bit underwhelmed. And that was my fault for having false expectations based on somebody else's experience.",
      "Not really. I find that if I travel with a mix of everything, I enjoy everything to the fullest everywhere I go. As soon as one place peaks I’m onto the next. For e.g. my last trip to euro one section of my trip I went Swiss for 2 weeks, enjoyed the nature, then Italy 2 weeks,\nEnjoyed the food, history & architecture then Greece for 2 weeks to enjoy the beaches and relax..then rinse & repeat. If I get too much of the same thing, I start to get bored and maybe appreciate the places a little less whereas if everything is fresh & new. If that kinda makes sense. I think this idea of things were better in the past is kinda dumb. People in the past had different problems, and say even if they were what you gona do about it? So many people romanticise things in their heads and never get to see what it actually is. You seem to be privileged enough to actually play it out, and experience it. So don’t take it for granted and enjoy every moment",
      "Have you traveled internationally a lot? I ask because I’ve traveled a lot at home in the states. And even if I travel to a new city let’s say New York, where I’ve romanticized Central Park in Christmas etc. I’m left in a “meh ok, yea it’s cool.” \n\nHowever, last year I traveled abroad and although I did a lot of research and knew cities would be touristy and congested, I was in awe. It was a fun surprise to learn the history and culture. Have you thought that maybe if you travel a lot you may be a little numb to it?",
      "Nope. History is history and now is now. How geography, urban design, societies exist because of that history will always be fascinating to me.",
      "Modernity definitely plays a role, I think. For me anyway. When I see/hear parents travel photos and stories from the seventies I realise just how much the world and tourism has changed. They nearly died multiple times but they also saw stuff like the Taj Mahal with no one else around. Luxor Temple - just them (was actually a pretty dangerous situation). Palace of Versailles: one other tourist. And so on. My mom can't stand what the Seychelles or the Philippines look like now (touristy, built up, decimated nature compared to what she saw). I remind myself that tourism keeps some of these places preserved as no one would have the money to keep them as they were otherwise, but I think it's not all in your head. Mass tourism and social media expectations combined has really screwed us. I have started assuming that anything that is hyped may quite possibly be a disappointment and try to plan around my more niche interests than \"top sights in Paris\" etc.\n\nDepending on the cause of your feeling of disappointment this may or may not help. Places I can recommend that did not disappoint me and felt otherworldly:\n\nHumahuaca, Argentina: absolutely incredible colorful mountains but pay attention to what time of day is best to see them as the color depends on the angle of the light.\nPurmamarca also worth seeing but far more touristy.\n\nIrusha, Argentina - mind blowing mountains, very few tourists. In the afternoon the mountains magically seem to become colorful (as long as it's not overcast as the colours are a result of the angle of the sun hitting mountains corroded to lower level minerals exposed by the strong winds). \n\nIguazu Falls, Argentina: you need to make sure it's a good season so that the falls are full, also super busy with tourists but still more amazing than I was expecting. And the masses of butterflies were really unexpected!\n\nCappadocia, Turkey. Again, incredible mountains (I like unusual mountains as you can maybe tell). The hot air balloon ride was nice but not as incredible as I'd heard. Maybe I'm just not a person who cares about seeing stuff from the top that much. I loved looking up at them from the ground though and the mountains and caves were...like being on Mars.\n\nChobe National Park, Botswana...amazing if you love animals (haven't been to the Okavango Delta yet but it's on my bucket list). A whole lot more national parks in Africa than I love, but I guess you've got to want to see lots of animals to love it.\n\nBlyde River Canyon, South Africa. Three Rondavels mountains. The start of the official viewpoint gets crowded but the you can keep walking and find quiet spots. Also a lovely area for hiking or road tripping.\n\nLake District, UK: amazing if you love lakes, fairytale mossy forests, adorable English villages (some more crowded with tourists than others, June - August is too busy with local tourism), cream tea, cutest shops, and day hikes.\n\nIn terms of old town European cities, Innsbruck, Austria, Krakow, Poland and Czesky Krumlov, Czech Republic, were very pleasant surprises. I certainly hadn't really heard much about them so I was surprised instead of having expectations.\n\nFood: I've reached the stage where I assume that if it's food in a tourist district, it will be average to bad 😂😭 Any place that gets a lot of hype doesn't rely on repeat customers so the food can be as crap as they like. All my worst meals were in tourist hotspots.",
      "I think traveling is like doing drugs.  You’re always trying to reach that next great high… and sometimes it’s hard to find the next one if you’ve already done some really amazing things.  Nothing lives up to your expectations.  Had a pretty tough one over the summer- went on an Alaskan cruise, that I had planned for 21 friends and family.  I had anticipated Glacier Bay to be incredibly magnificent and it ended up being a foggy, rainy disappointment and the mountain ranges were nothing to write home about.  Whale watching was pretty boring.  Canoeing to a glacier was just ok.  It was a really expensive disappointment to my entire family.  But I’m still searching for that next amazing high.",
      "Nope.  Never. I also don't spoil anything by watching videos or doing heavy research beforehand.\n\n\nSounds like you need to manage expectations and fall less for marketing.",
      "If you want a time capsule experience, Cuba is probably your best bet.",
      "I think a lot of it also has to do with how easy it is to get regional content, so it's easy to develop a biased interpretation as you would be gravitated towards content favourable to you. The persona self-perpetuates.\n\nThe other thing spoiling that effect is how global brands are now.",
      "It helps to travel to places many don't go to. For example don't go to Costa Rica, go to Guatemala. It's hard to have preconceived notions about a place that nobody has romanticized yet. Then try to go off the beaten path although this is best done with a friend or two. I have been to places in Latin America where foreign visitors are very rare and where I felt like I had traveled back in time to the 50s. Then, whenever you find yourself in a popular destination and it's packed with tourists, usually there's a place just around the corner that is just as spectacular and there's nobody in it. Also India never disappoints. It's hard to get used to but once it sinks in you will feel like you have one foot in the present day and the other foot 800 years in the past.",
      "I used to be disappointed sometimes. But now I see the present and modernity as a continuation of history. I went to the Chopin Museum in Poland recently and it struck me how similar the 1800s were to today. Those on a Grand Tour were complaining about the spots they visited in their travellogues, and the Neoclassics were trying hard to look at the idealised past and shunning their modernity. Yet, when we look back at those times, we see something worth looking at, learning about.\n\nModernity, thus, is not a clash with the past, but a continuation of it. I try to experience the contemporary and futuristic elements of a country as part of my visit.",
      "This is the reason why Paris Syndrome became a thing.",
      "I understand what you’re saying. I just always readjust my mindset if a place isn’t what I expect (and try to focus/appreciate the good things I wasn’t expecting). \n\nI prefer to travel to developing/underdeveloped/non-western countries for the exact reason you state and have found them satisfying enough. I, too, am trying to find those places but also don’t mind stumbling along from country to country until I find these places. Really love Albania & just got back from Georgia (the country) & Armenia. I’m hoping the “Stans” will provide me a decent slice of this so planning to go to a few next year. Following.",
      "The glory days of travel are over. All you get now are carefully packaged excursions and kept a safe distance from antiquities so they aren't damaged which is sensible but not what people enjoy. It's all.just a money grab. \n\nPlaces are swarmed with tourists and often there are attempts to have amenities to please tourists which are not the local.culture at all because so many people don't actually want to experience a different culture in reality. They don't want to eat foreign food."
    ],
    "comments_lev2": [
      "When it's collapsing due to human interference it does 😭 Source: just spent a month in Madagascar...80% deforested, a large part in the last 10-20yrs.",
      "That is very true. I've never been disappointed by the natural wonders.",
      "Agreed, all of my best adventures were in nature. Even the people are nicer out there. \n\nIf you've been to one international city, you've been to them all... I tried bar hopping in Ireland and it felt super pointless. Like yes, now I'm engaging in consumerism and listening to 80s songs in various locations while absolutely nothing happens.",
      "Yes, it does. You apparently just don't experience that feeling.\n\n/r/natureisterrible",
      "I agree. I hate surprises but I love being surprised, does that even make sense? I just wish it was more in the positive than the negative. I'm sure I'll find it after a few more destinations.",
      "That hits home a little. I'd say it's 50/50 between that and perhaps just not having found the right destination or style yet. Hopefully...",
      "I was reading the travelogue A Short Walk in the Hindu Kush where the author goes to the most inaccessible part of Afghanistan, a remote valley in the mountains. I wanted to see how it looks right now on Google Maps (the book is from the 50s).  It's still not somewhere you could even visit right now bc its under Taliban control. But, guess what they do have? [Pepsi, Monster, Red-Bull. ](https://www.google.com/maps/place/Parun+Walayta/@35.4207113,70.9233336,3a,75y,90t/data=!3m8!1e2!3m6!1sAF1QipPADLQZFzyEYaHpYJvgM_WqPYPFRxolzYoll-S8!2e10!3e12!6shttps:%2F%2Flh5.googleusercontent.com%2Fp%2FAF1QipPADLQZFzyEYaHpYJvgM_WqPYPFRxolzYoll-S8%3Dw154-h86-k-no!7i1941!8i1078!4m11!1m2!2m1!1sgrocery+store+near+nuristan+afgahistan!3m7!1s0x38dac30c8dbd5e1f:0xef146d55448afb6c!8m2!3d35.4207113!4d70.9233336!10e5!15sCidncm9jZXJ5IHN0b3JlIG5lYXIgbnVyaXN0YW4gYWZnaGFuaXN0YW6SAQ1ncm9jZXJ5X3N0b3Jl4AEA!16s%2Fg%2F11sv1snhwd?entry=ttu&g_ep=EgoyMDI0MTExOS4yIKXMDSoASAFQAw%3D%3D)I tried the same thing in the most remote area I have personally been to, close to the disputed India-China border. Of course the same thing, every [Coca-Cola product you could want](https://www.google.com/maps/place/Namo+Buddha+Grocery+Store/@34.0989832,78.11916,3a,75y,90t/data=!3m8!1e2!3m6!1sAF1QipNMQh5kVgzLtDkc6Fn5GoRG2JK4LOQ28caM9GkS!2e10!3e12!6shttps:%2F%2Flh5.googleusercontent.com%2Fp%2FAF1QipNMQh5kVgzLtDkc6Fn5GoRG2JK4LOQ28caM9GkS%3Dw114-h86-k-no!7i4000!8i3000!4m12!1m3!2m2!1sgrocery+store+near+Tso+Moriri!6e6!3m7!1s0x38fe1b00182bf2ed:0x692d5158336bb0bc!8m2!3d34.0990999!4d78.1193823!10e5!15sCh1ncm9jZXJ5IHN0b3JlIG5lYXIgVHNvIE1vcmlyaVofIh1ncm9jZXJ5IHN0b3JlIG5lYXIgdHNvIG1vcmlyaZIBDWdlbmVyYWxfc3RvcmWaASRDaGREU1VoTk1HOW5TMFZKUTBGblNVTkliV0l6VHpSblJSQULgAQA!16s%2Fg%2F11w8shzwv_?entry=ttu&g_ep=EgoyMDI0MTExOS4yIKXMDSoASAFQAw%3D%3D). Coca-cola must have the best distribution network of any other company in the entire world. It's so nuts. If you've been to remote places, you know how hard it can be to get western products; or even gasoline and electricity. Sugar-water though, fucking ubiquitous.",
      "Yeah I agree globalisation is partly to blame. Massive benefits for everyone, but my own personal selfish disappointment lol. \n\nI do need to go more off the beaten path. I did a few group tours recently hoping it would enable one to do just that but that didn't quite scratch the itch. Any tips?",
      "Another problem of the modern world, and I hadn't considered how much this also impacts this too. \n\nIt's so obvious in other areas (I'm looking at you every influencer ever), but I guess I wrongly thought the romanticisations were innately from within whereas in fact you're very right, like everything else they're a result of the media we've consumed for decades, selling us a view that isn't real. The age old advertisement of the ideals and not the reality! \n\nThat actually has really helped. Simple, but made me feel better a little already. I've already come to terms with everything else being fake, I should accept this too and come to terms with finding the real wonders without preconception.",
      "I agree, it would be very selfish if I expected everyone to stay in the past for my benefit (although that'd be lovely sometimes lol). That's not what I'm saying at all, perhaps it's just a shame we didn't globalise differently whilst maintaining more of traditional cultural identity I suppose. I think I need to pick some different locations and styles of travel to just get that part of it out of my system.",
      "This resonates. \n\nThe world lacks community. Though community is hard to find when you're in a country where you know about ten sentences and five other words lol. \n\nSouth America may feel better I think. Haven't been yet but I can speak Spanish quite well so would give more opportunity for de-alienisation.",
      "100%. There need to be more companies actually doing this. So far I've really only found those saying that they do, but during the trip I have not felt that vibe, and it just feels like commercialised snippets.  \n\nMy worry is it borders on exploitation which I would hate much more than my disappointment. Find the experiences where, to hijack your example, the locals perhaps live a more traditional lifestyle, but they're content, if that exists. Most humans at least always desire something more than what we have though don't we so it probably doesn't.. Travelers privilege dilemma strikes.",
      "I don't think it's even the duration. I'd love to be able to spend months feeling immersed but I think that would make it worse as you see how 'normal' everything is as opposed to new and wondrous.",
      "Very true. The dopamine overload essentially.",
      "I wouldn't say I don't like it. I always enjoy it, it just never quite is what I hope/imagine.",
      "Honestly.. no. It's just never the same and I can't even tell you why. I think I've come to a few realisations from other comments which have really helped, and I'm wondering how much of it is actually a current feeling that I don't feel in the moment during the trip. I think I just want to experience the differences of life, and haven't felt that so far, at least not in any significant way.  \n\nI fear I'm yearning for an experience that doesn't exist, but hope it's just that I haven't found the right one yet. I fear it's an internal rejection of the way of modern, and nothing to do with travel. I fear it's an incorrect assumption that travel is the solution but it might in fact be a scapegoat. \n\nI think I need to try a style of travel that is more back to nature, back to simpler living, immersing in a different way of life. I was looking at a trip staying with a local tribe in Guatemala learning their language, their way of life, and I'm starting to think that might open my eyes a bit about what the true issue is. I might just be over analysing and over philosophising at this point, but the conversation in the comments has got the cogs whirring.",
      "I don't see it as overthinking, but if I'm investing my time and finances in something for a purpose, I want to make sure it fulfils that purpose.",
      "I read a lot of stoic philosophers and I agree, but one must weigh the cost benefit if you don't get what you expect from these things.",
      "I do try, I'm usually a nerd for research and planning but whenever I plan to visit somewhere that excites me I do no research whatsoever other than cultural norms to avoid offending anyone etc., in the hopes to feel more amazed when I get there. I do think part of it is I just don't really like the modern way of living too, and that plays a part in disappointing me as it's inescapable everywhere I've been so far. \n\nI am starting to also think it's just because I need a holiday and the other feels so far in the past now (despite my last only being in September...)",
      "I've only been to Calabria a few times so far, Tuscany is next year!",
      "Never trust the opinion of anyone who doesn't leave the resort lol. I will never understand that type of holiday personally! \n\nNext time I'm away I'm going to try and consider my 'disappointment' DURING the trip I think. I wonder if it's just because I want more as soon as I'm back that I trick myself into thinking it was disappointing in retrospect..  \n\nUnique experience gluttony and greed maybe.",
      "I have, but I'm from the UK not US. I've only really travelled internationally, not much to do on this island, I'll save that for retirement lol.",
      "These are some fantastic recommendations thank you. They are places, for the most part, that I imagine I'll be taken a back. \n\nTo parallel your love of mountains, I almost cried once at the top of what was effectively a small hill in a completely unknown part of Italy because I was just in awe of the mountains around me, and the gradient of the shadows they create as they fade into the background. Similar experience in Ha Long bay. They're not mountains but the vistas are some of the most beautiful things I've ever seen - that's one place that certainly didn't disappoint.",
      "I think what you're saying is we should instead both just try crack or meth?\n\nJokes aside, I agree. And am very jealous of your disappointing Alaskan cruise!\n\nI don't know if it rings true here when you're planning for 21 people, but it's like that theory of if you make a sandwich yourself it's never as good as if someone makes one for you and oftentimes you don't even bother eating or finishing it.",
      "I was very shocked when I was told I would never get Coca Cola in India and it was all Thumbs Up cola, was looking forward to that very small deviation from the norm. I then arrive, and all I get is Coca Cola lol.",
      "Interesting list of places, the 'stans' have recently become top of my list for this exact reason. Perhaps I'll add Albania, Georgia and Armenia too, thanks. I went to India last year and even felt it there to some degree. This was the golden triangle though so I intend to return and discover the south a bit more outside of the more tourist hotspots!",
      "The thought that this could be true is my biggest fear. Capitalism having ruined one of the few remaining pleasures we had left.",
      "They are. My parents travel photos from the seventies are something you would not believe."
    ]
  },
  {
    "id": "1gyfvdl",
    "title": "Any Caribbean island like PR but with nicer beaches?",
    "text": "I am looking for a place in the Caribbean to visit that would have a beachfront resort to a calm,  clear beach but also a nice town with nightlife, bars etc. \n\nSan Juan Puerto Rico has been great for this in the past but my only caveat is the beaches are not calm or as nice as say Bavaro in DR. \n\nNot trying to do an all inclusive which is why we ruled out Cancún/DR.\n\nWould St Martin fit this bill? Curaçao looked nice too, but seems like the beaches are small. Ideally also somewhere where car rental isn't necessary. Turks and Caicos seems out of budget ",
    "comments_lev1": [
      "Yep definitely St Martin! I live there actually so perhaps a bit biased, but I’ve been to other places you’ve mentioned and agree we have amazing beaches, great nightlife, but also peaceful vibes, there’s something for everyone here. And definitely more affordable!",
      "What is your budget?",
      "St thomas, st croix, St. John - USVI\nJamaica - look at round hill (montego bay) or another luxe but not all inclusive resort that is close to nightlife\nSt Martin",
      "St John USVI"
    ],
    "comments_lev2": [
      "Thank you! Anywhere in particular you recommend?",
      "Ideally <600 per night for Feb but <500 is better"
    ]
  },
  {
    "id": "1gybwz1",
    "title": "Traveling to Ireland",
    "text": "Hello,  I'm new here, so I hope I'm not breaking any rules.   My husband and I (Americans), are traveling to Ireland next year.   We are both polite and, I like to think considerate, people.   I don't want to cross any lines that would make people think we're ugly Americans.   I don't think we will,  but are there any guidelines or unwritten rules we should know?   Thank you in advance.   This is our first trip out of the US.  ",
    "comments_lev1": [
      "The fact that you're here asking this question probably means that you have absolutely nothing to worry about. Treat people and the environment with respect and courtesy, just as you would anywhere else.",
      "In February 1998, I asked a beautiful girl out on a date. I was 28 at the time and had not been especially \"lucky\" when it came to finding love in my life (note: I had known this amazing girl for a number of years, and we were good friends. So when I asked her out, it felt fairly natural and easy.) As it happened, we were a great match. In April, two months into our romantic relationship, she asked me if I wanted to travel with her to Ireland for her cousin's wedding in early July. I immediately accepted her offer. We spent ten days traveling the West Coast, cavorting with her extended family as well as spending amazing time on our own in what seemed to me to be the most beautiful place on Earth. Doolin, Galway, Clare, the Cliffs of Moher, the Aran Islands. Every bar we went into we made a friend. Every B&B owner acted as if they had known us for our entire lives. My advice is this: be yourselves. Ireland and her people will meet you where you are at. I knew at the end of that long-ago trip that the woman I was with was destined to be my wife. And that is why I proposed to her and married her not long after our Ireland adventure. Have a wonderful time in Ireland and may health and happiness be your tripmates!",
      "You’ll be absolutely fine. Just don’t go around proclaiming that you’re Irish, we don’t take very warmly to that! Being very loud is another thing to avoid. On the whole, we’re a friendly bunch who enjoys visitors coming to our shores. Enjoy!",
      "Irish are some of the friendliest and most out going in my experience.\n\nI’ve been twice, avoid politics and religion and you’ll have a great time lol",
      "If you are planning to drive: always wave back when a driver waves at you as you cross paths.  Its kind of a tip of the hat thing that I found utterly charming and was nowhere else to be seen in the world. \n\nAlways smile and be polite. Expect the same. Ireland is wonderful.  Enjoy your time there.  I especially like Donegal IMHO it was the best part of my trip",
      "I just came back from my first trip to Ireland 2 weeks ago. It was the friendliest country I have ever been in. I don’t feel like I had to act a certain way, just be a nice and polite person.",
      "Get the smallest car and if you're driving on roads where cars can go both ways but only one car will fit on the road, if coming face to face with another car and you cannot pass - the smaller car of the two is supposed to backup.",
      "The ugly American stereotype is from Americans walking into a store in another country, avoiding the line, and loudly getting annoyed that they don’t have gluten free sugar free Oreos like they do in America, while yelling at the shop owner to “speak English dammit” and trying to pay with USD because “everyone likes the dollar the best” and being surprised that no one knows exactly where Glens Falls, NY is, while refilling a big gulp cup at a pay for refills soda station without paying. Preferably while asking some other tourist if they appreciated us “liberating” their country from “fascists” (when they’re from Switzerland). And then getting in their car, and driving down the wrong side of the road, straight though the roundabout. \n\nDon’t be that person.",
      "Head over to r/irishtourism and read through the threads there. Also lots of great info on what and where to visit.",
      "I find Americans only talk about America. Show internet on other people. Don’t mention Trump",
      "You’ll be fine.",
      "Just be nice, kind, patient people!  A little goes a very long way. Ireland is one of my favourite places in the world to travel. The people are amazing, so friendly and very funny!  The life skills you use in your own city or town are the same skills you need everywhere else.",
      "Compliment every man and woman you meet by telling them they look like Marty Morrissey.",
      "Say thank you. People give you advice online - thank them. You’ll notice once you’re in Ireland, people will thank the shop assistant, the bus driver, the waitress, etc. Just a quick “thanks”, but it helps everyone feel valued and seen. That’s a cultural difference you can participate it. Enjoy your visit! There’s also a sub you might enjoy for tourists visiting Ireland",
      "Doing the same thing next year. I realized the orange hat I normally wear in cold weather might be..awkward.",
      "As others have said, you're asking the right questions which shows that you have the right attitude. I've found the Irish to be very friendly and welcoming toward Americans; you really only need to remember two rules:\n\n1. Do NOT claim to be Irish unless you were born and raised on the island. It doesn't matter if both of your parents are of full-blooded Irish ancestry.\n2. Use caution when discussing Northern Ireland and its history. The Troubles may be over, but a lot of people (especially in the North) still have very strong feelings on the subject and you will at best get biased information and at worst start a very heated argument.",
      "**Notice:** Are you asking for travel advice about Ireland?\n\nRead what redditors had to say in the **[weekly destination thread for Ireland](http://redd.it/2wzstr) and [here](http://redd.it/3883ju)** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "Most of the time we kept to the wild and scenic coasts but the cities have charms too.",
      "Check weather forecast before you arrive, weather is very changable.",
      "Make sure you have room in your luggage for gifts and souvenirs. My wife and I brought back several hats, sweaters, and various mementos.",
      "I (American) just got back from Ireland. The fact that you are asking this question and are trying to be polite and respectful, tells me that you will be just fine.  Just saying hello, thank you and practicing general good manners will be appreciated.  The Irish people, that I interacted with, had a surprisingly similar sense of humor.  You will have a fantastic time.   Enjoy your visit.",
      "Some not so obvious advice lol \n\nFood shops generally close fairly early and open later (compared to the US) so if you need snacks for an early morning or late night, plan ahead. \n\nIf you order a pint of Guinness, don’t just drink the head off it first.\n\nIreland is getting more and more cashless by the day, almost every single place will take Apple Pay or card. \n\nYou pump your gas first, then you go inside and pay.\n\nYou typically get up and pay for your meal with the host when you are done eating at a restaurant. It’s uncommon to get a bill and have the waiter come take your card. Unless you specifically ask. \n\nAccents will vary greatly as you move through the country! If you make it to the very north of Donegal or the west of Galway there will be a lot Irish spoken but most people do speak English too. \n\n\nIf your dates are flexible, I’d advise early September. It’s always the most consistent weather. Typically sunny and warmer as the kids go back to school. \n\nSome of the gas stations have the BEST delis. Make sure to stop for a sandwich or hot chicken roll when you’re on the road. \n\nThe west side of Ireland is the best side (I’m slightly bias but it’s the truth lol) \n\nRent the smallest car possible if you’re planning on driving country roads.\n\nDo NOT drive fast past horses on the roads. Pull over, stop and let them pass. People often ride their horses on the country roads.\n\nPeople also walk the very small country roads, take it easy going around bends. Animals are often in the road, or you can come across farmers moving sheep or cattle. Just be patient :) \n\nIt’s become very common to see pop up mobile saunas at Cork beaches. (I can’t speak for other counties but I’m sure they have them too) I’d highly recommend trying them out and taking a sea dip. \n\nHave fun! :)",
      "Weather changes hour to hour, and minute by minute.\n\nIrish people are some of the friendliest in the world.  Use any modicum of judgment and you will be fine!\n\n\nIf you like fish, Irish fish and chips are incredible.  Enjoy a pint at a local pub!  Are you going just to Dublin or around the country?",
      "Continue being considerate, thats all you need to do.",
      "Why would you go there - hideous depressing weather, so expensive, mostly ugly buildings and there still no way to get from Dublin airport to Dublin. So many better countries nearby?",
      "You will do great.  I found the Irish to be very open, interested to engage in discussion and ok with controversy and politics.  They seem quite fond of Americans and America because they spent so long seeing America as independent long before they gained theirs.\n\nThe only notable item came up during a musical pub tour was one American gent who was acting all boastful about his musical prowess and then completely bombed when he tried to play.  The performers quickly invited the next guest.\n\nWhen tourists were doing the wrong things Irish folks were quick, clear, to the point and then moved on without dwelling or holding a grudge.\n\nDo yourself a favor and seek out true Irish experiences as a lot of the pubs are playing pop western and while its familiar you would miss opportunities to experience culture.",
      "I would avoid ball caps and American flag clothing, too."
    ],
    "comments_lev2": [
      "Thank you!",
      "What a wonderful story! And I agree, I found the Irish to be friendly, straightforward, and unpretentious. Met so many characters, especially those that were older and had stories to tell.",
      "I love this!  Thank you so much!",
      "Thank you!  My husband and I have Irish ancestors but would not claim to be Irish.  Neither of us is loud!",
      "Caveat being the history of the country is fascinating, religiously and politically speaking, so don’t give your opinion, but a lot of people will talk to you about it and you shouldn’t be shy of asking questions\n\nMy tip would be to avoid saying you’re Irish if it’s your great great great great grandfather on your dad’s side or something.\n\nIrish get very eye rolly about Americans finding their roots.",
      "I only talk politics with people I know are like minded and would never try to engage with people I don't know.   My husband never talks politics.   I am not religious at all.  My husband is, in his way,  but doesn't talk about it.",
      "But expect them to bring up American politics. Have been there 3 times, the last 2 within the last 2 presidents and 1 of those 2 during our past election. They are pretty open about their feelings on our politics.",
      "We are traveling with my daughter and son in law who have been there before, so my SIL will be driving.   Donegal is our target.",
      "Thank you!",
      "Thank you!  Having lived in the Midwest where the weather changes on a dime,  this is not new to me.",
      "Would never do that!"
    ]
  },
  {
    "id": "1gxsyej",
    "title": "What's a country you've been to that's rare for travelers of your nationality to visit?",
    "text": "Some countries are generally popular, others attract specific nationalities largely due to their proximity. However, can you name a country you've been too that most people in your country say they've gone, even if they're seasoned travelers?\n\nFor me, I haven't really been to a \"rare\" country yet because I've only visited Canada twice from the US, and then Germany, the Czech Republic and Poland earlier this year (with a layover in Ireland). All of those are pretty common. However, I am planning a trip to Cuba in the near future as an American. Even after travel to Cuba was opened up to US citizens by Obama in 2015, it's still not common for Americans to visit likely for a number of cultural and practical reasons.\n\nIn 2018, around 600,000 Americans went to Cuba compared to 1.1 Canadians (a nationality known to favor Cuba as a tourist spot). While that does put the US in second place in terms of nationality of foreign tourists, consider that the population of the US is well over 300 million, and only a fraction of a fraction of 1% of US citizens went to Cuba that year. Meanwhile, 1.1 million Canadians in Cuba isn't just nearly twice the amount of Americans, it also represents a significant portion of Canadians in general due to the population being much smaller.\n\nI'm planning to visit Cuba specifically for the unique scenery and culture, and because it's an adventurous and unorthodox destination for Americans that only recently became available at all. I'll report back here ASAP when it's done.\n\nBut that inspired me to ask this question, to see what countries Redditors here have visited that are really rare for their own nationality, even the most well-traveled?",
    "comments_lev1": [
      "Djibouti. Not many Australians head there.",
      "Indian citizen. Visited Colombia , Ecuador and crossed the land border into Peru. Took me an hour to clear immigration bc border officials were unsure of my eligibility to enter Peru on Indian passport (they (officers on duty that day, at least) had never encountered an Indian national crossing the land border).",
      "I'm from the US, and one of the rarest places I’ve visited is Bhutan. It’s not a typical destination for Americans, but the serene landscapes, unique culture, and emphasis on Gross National Happiness made it an unforgettable experience. Highly recommend it if you're looking for something truly special!",
      "I’m American and I think Kyrgyzstan might fit the bill. Was there in 2007",
      "As an American: Yemen, followed by Madagascar, followed by Mauritius, followed by San Marino.",
      "Turkmenistan from USA.",
      "I've been to Bhutan, Comoros which aren't that huge for tourists in general.  But i thought there were qwuite a lot of americans in Cuba.  I'd say as an Australian, Central america and the caribbean are not common places to spot an australian in the wild, whereas SE Asia and the pacific we are everywhere.    \n  \nFunnily enopugh I was also in Namibia a few years ago and didn't realise how popular is was for Germans (I did know about its german colonial history)",
      "Having lived in Brunei, I don't recommend it for tourists.",
      "Pakistan, as a Lebanese person",
      "As Australians in Bulgaria we were treated like unicorns (in a nice way)",
      "Not a country, but a US state: North Dakota. According to the locals at the time \"no one comes here for tourism!\", and I guess doubly so for people from Portugal.",
      "Chad! Not many brits go on holiday there! Food was good too",
      "American here. I'd say many places I've been. \n\nFiji 🇫🇯 , seemed to get a lot of Visitors from Australia/NZ and of course from throughout Pacific Island countries. \n\nSuriname 🇸🇷,  this Dutch Speaking South American country seemed to get most visitors from The Netherlands,  but also a good chunk of Brazilians and other Spanish speaking Latinos. \n\nOman 🇴🇲,  don't remember running into any Americans there. Such a beautiful place to see, I understand why so many Europeans, Asians, and other Arab folks visit. \n\nThose to name a few!",
      "Burkina Faso.",
      "I haven't sadly got to travel to places of my choice, since im still a teen so my parents decide where we go. So it will propably be Bulgaria. I can also tell you the opposite of the question. I'm Finnish and never been to Sweden. That is very rare id say.",
      "I am American. I was a Peace Corps volunteer in Ghana. I visited Venezuela three times.",
      "Based off of the number of times I heard from locals \"American?! What are you doing here?\", it would seem not many of us make it to Malta.",
      "In Slovenia they kept asking me if I was lost and what an American was doing there.",
      "Senegal, Tunisia and El Salvador",
      "I was in Malawi back in 2014 and to this day, I’ve only met one other person who had traveled there. I’m from the States and the other person was a journalist from Australia",
      "Andorra, I guess because it's a bit out of the way for UK visitors. If not Bosnia - now visited twice and it's got stunning landscape.",
      "Canadians love Cuba and there's some really good package deals. I have a friend that goes every year. \n\nI love Cambodia and all my CAD friends are a bit freaked out about coming here to visit me. They don't know what a peaceful, friendly and safe country it is now.",
      "As an American: Sri Lanka and Mongolia. They’re just far and closer to more major destinations, being India and China.",
      "I'm from Poland and this year I managed to visit Rwanda. It's a lovely place, great people, definitely need to come back for a bit longer.",
      "Didn't meet many other Americans in Uzbekistan, especially not other solo traveling American women.",
      "Kazakhstan, Uzbekistan, Kyrgyzstan, Tajikistan, Iran, Bangladesh, and Malawi.",
      "Maybe not quite the same, but people came to the US usually visit California, Florida, New York, Washington DC etc. I ended up in a small city in Georgia for college. I guess people there are not used to with foreigner, they were confused why would anyone from outside US visit Georgia.",
      "Algeria, Haiti, Greenland.",
      "Tanzania is probably the one for me. I'm Canadian and went in 2019. Mgovsl place",
      "From the USA. \n\nI spent a few days in Oman and really enjoyed it. \n\nI went to Azerbaijan for 3 days.",
      "My wife and I cycled south to north through the eastern bit of the Netherlands. The Dutch generally had two questions: 1) Why? and 2) You're not British? Apparently, not many Americans ventured into that part of the country. Their loss: it's quite pretty.",
      "North Korea, Bhutan, Saudi Arabia, Brunei, Bangladesh, East Timor\n\nAll are quite rare for an Australian or anyone from the western world",
      "Belarus",
      "Pakistan, KSA. I’m from Western Europe.",
      "Probably Iran or Pakistan for me (US/UK) but not that unusual when you live in the Middle East anyway.",
      "[removed]",
      "Botswana. I’m from the US and most of the non-African foreigners I’ve seen here are Europeans, Indians, and Chinese.",
      "Azerbaijan, Uzbeckistan and Laos, I’m from the UK",
      "St Pierre and Miquelon, Dominica, Cook Islands, Lesotho, Uzbekistan all don't see many tourists from my country.",
      "Although there’s lots of Australians with ancestry from there, maybe Bosnia or Slovakia? I doubt most Aussies could point to either on a map",
      "Relatively few Canadians break out of the US/Sun/Western Europe options. So I've been to lots of countries that are unusual for a Canadian to visit.\n\nI don't have visitor numbers to check, but my impression of most unusual to least would be:\n\n- Syria\n\n- Jordan\n\n- Venezuela\n\n- Bulgaria\n\n- Romania\n\n- Ecuador\n\n- Malta\n\n- Turkiye\n\nWhen I went to the Czech Republic, it was an unusual destination. Was there in ‘98, which I believe was the first year they dropped the visa requirement for Canadians. Of course now, it’s definitely on the mass tourism circuit.\n\nThat's what comes to mind as relatively uncommon in my mind, but maybe I'm missing some.",
      "Oman",
      "Ukraine, Bosnia, Oman, Myanmar. I’m from USA.",
      "From NZ, locals were very surprised when I was in Serbia",
      "Indian, visited Colombia & Peru",
      "Georgia. I’m from the US",
      "Bangladesh. Rare for Brits apart from those of Bangladeshi descent, which I am not.",
      "Tanzania as an American in 2006",
      "Paraguay, Slovakia",
      "I’ve skied in Iran, Israel, Lebanon, Kazakhstan, Kyrgyzstan, and Uzbekistan. And Portugal. I’ve skied in Lithuania, Latvia, and Estonia. And 42 other countries.\n\nDual Citizen - US/Switzerland.\n\n❄️ ⛷️ ❤️",
      "Venezuela.  Was down in Grenada (also a bit uncommon) and popped over there for a long weekend.  This was at the height of the Bush/Castro hostility so my buddies and I were a bit nervous.  Honestly, the people were amazing and treated us like a bit of a novelty.  They were amused and grateful by our cooperative gringo spanish (okay, I can conjugate verbs and you know more adjectives and...) and mostly seemed glad we weren't German.  \n\nWe're also not super common in Jordan.  I feel like more Americans go to Israel (pre war).",
      "From the US, been to Angola and Uzbekistan",
      "Bangladesh…..LOL",
      "I'm a bi-racial male from the US. I've been to Ukraine, Romania, Poland, Czech Republic and Serbia. I really liked Eastern Europe.",
      "Ramallah - Palestine, I'm probably the only Cypriot of my generation to visit. It's not really a holiday destination.",
      "Turkey, Indonesia (not Bali), and Malaysia. Met lots of travelers but very few Americans. Probably has a lot to do with overall American xenophobia towards Islamic countries, and the distance from the US.",
      "A small town in Sicily. I was the first American to ever come back",
      "From US, went to Russia a couple times.",
      "I suppose China. I’m American. Seems like it’s becoming a bit more popular these days, I went back in 2015. One of the cities I went to was ChongQing and when I told people that most people thought I was joking, and certainly no one had heard of it. Recently I’ve been seeing a ton of videos about that city and the crazy infrastructure they have!",
      "I don't see many people from my country in Thailand."
    ],
    "comments_lev2": [
      "I’m an Australian that’s been to Djibouti too! Whale Sharks, Ethiopian beer, French food. Amazing.",
      "Work or pleasure?",
      "Really want to go there but need to save!",
      "If you dont mind, tell me about yemen! Mainland? Socotra? How long was the trip? What did you do? Did you feel safe? Etc",
      "How were the Comoros?",
      "I intend to go there next year, just for a couple days. Anything specific why not or to be aware of? Btw, solo trip and I'm a 50 yo male.",
      "I was coming to say this! Someone asked me what made me come all the way there from the U.S., and I was almost confused as we sat in a really beautiful, quaint agricultural town surrounded by mountains on all sides lol. Have you seen where you live?! No but really I just told her how I came across it on Google maps and saw how beautiful it was",
      "That’s funny because when I went there I was indeed confused because there were SO MANY Americans.",
      "Probably one of my favorite countries I’ve ever visited. Also American!",
      "It's kind of out of the way for most people. I mean, I did a road trip through the French side of the Pyrenees a while back, but from San Sebastian to Barcelona. I kind of wanted to got to Andorra, mostly just for the sake of going there, but it didn't really fit our plans. I guess because we did a detour to Carcassonne and then one of the people I was with wanted to visit coastal Catalonian towns on the way to Barcelona.",
      "What!? Lol",
      "KSA is fairly common for Western Europeans",
      "I feel that’s pretty common? They’re both countries in the same cultural hemisphere. Share a script and religion plays a major part for both.",
      "I’m from the states and visited Palestine in 2015.",
      "I was in Ramallah couchsurfing in 2016 and it was the best time, meeting wild people. Definitely game changer if you have local people to show you the best spots. Made some good friends there.",
      "It’s a fairly common destination if you’re from the Levant.",
      "Not sure why your comment was downvoted so I upvoted to try and help",
      "I feel like Bosnia is popping up a lot more with my Aussie mates. Slovakia not so much.",
      "Maybe it was rare back then, but I was there last year it seemed like there were a decent number of folks going on safari or going to the top of Kilimanjaro.  Most were European, but there was no lack of Americans.",
      "I had a layover in Bangladesh."
    ]
  },
  {
    "id": "1gy4air",
    "title": "Who Remembers Allegheny Airlines? People Express?",
    "text": "I (58M) was trying to think of all the out-of-business airlines I’ve flown on since I was a kid: \n\nDown East Air (Maine - Mass commuter line), Allegheny, Eastern, Continental, US Air, Northwest, WoW, People Express . . . \n\nWho can add to the list? Valujet, anyone?",
    "comments_lev1": [
      "DH and I took People's Express for a day-trip from Pittsburgh to NYC.   First plane out in the morning and last one back in the evening.  We brought back leftovers from a meal in Chinatown and the other passengers were offering us cash for the bag of leftovers.   Great fun.",
      "I remember flying on People Express!  They would roll the cash register right down the plane aisle so you could pay for your ticket.",
      "I remember all of those (I'm 50).  \n\nDefunct airlines I've actually flown on: Pan Am, Braniff, Continental, USAirways, TWA, Northwest.",
      "Ozark and Midwest Express are two from the midwest. Midwest Express had an \"all business class\" model. I really miss the bigger seats in every row but it obviously wasn't sustainable.",
      "Braniff\n\neta:  TWA, Trump (although I never flew on that one)\n Pacific Western, CPAir, Pan Am",
      "Kiwi and America West/US Air (who actually bought out American)",
      "Agony Airlines",
      "Danair, World Airways, Swissair, Crossair, Sabena, Thomas Cook.\n\nSome names which have disappeared but which went through various mergers, name changes, etc: JAT (now Air Serbia), Airtours (eventually became part of Thomes Cook), Britannia, Continental.",
      "I’ve flown on Eastern, Continental, ValuJet, AirTran, WoW, and some airline whose name I’ve blanked out (it was awful) between Colorado and Atlanta.",
      "I did Peoples Express from Sf to Toronto in 82.\nMiss matched seats like they went to the boneyard and went picking.\nHardest landing I have experienced.\nAh good times",
      "I used to fly Allegheny out of WV!  It was good while it lasted.",
      "Pan Am, TWA, Air Florida",
      "Piedmont \nWestern\nAirBC\nTransair\nBurrard Air\nWest Coast Airlines\nFreddie Laker\nDan-Air\nBEA\nB.O.A.C.\nSwiss Air\nWardair\nNWT Air\nTime Air\nMonarch Airways",
      "A couple of the Allegheny pilots are still kicking around at Piedmont (American Eagle) in Philly.  Maybe not for much longer though.",
      "My first-ever flight was on a People Express plan from Buffalo to NYC. I was 11 years old at the time and the thing I recall most distinctly is that the flight attendants collected the ticket fare AFTER we departed the airport. I believe the one-way fare was $19 per person (which, even in 1981, must have been some sort of promotional rate).",
      "I feel like I flew Alleghany to summer camp in the early 1980s.  DCA to Asheville NC.  By myself, but as a regular flyer who happened to be 11, not an unaccompanied minor.  My sister and I were so sophisticated we even knew how to ask at the counter to take an earlier flight and then call Mom collect with the new flight info.",
      "Don't forget Piedmont.",
      "I really miss Midwest Airlines/Midwest Express. The seats were so comfortable and the freshly baked cookies on every flights were a wonderful touch.\n\nOtherwise, I've definitely flown on plenty of airlines that merged into other airlines (Northwest Airlines, AirTran, and US Airways). \n\nI've flown on plenty of airlines outside the U.S. that have since gone out of business or merged into others as well – Jet Airways (and its subsidiary JetLite), Indian Airlines, and Vistara in India; OpenSkies in Europe (it was a French subsidiary of BA).",
      "Remember Song? (Delta)",
      "Republic, TWA, BOAC, Braniff",
      "Pan Am, TWA, US Airways, Eastern",
      "I flew Allegheny (Agony) Airlines out of Albany a bunch in the '70s when I was a kid.  They never went out of business.  They were repeatedly rebranded/absorbed.  Allegheny-renamed US Air-renamed US Airways-merged with American Airlines.",
      "PanAm, Trans Australia Airlines, Ansett, NAC (New Zealand), PSA, Continental, America West",
      "Hooters Air\n\nYup, that was an actual airline\nhttps://en.m.wikipedia.org/wiki/Hooters_Air",
      "I remember People Express. It was $19 for Buffalo to Newark. You paid cash on the plane after take off! I gave them twenty and got a beer too. Did that trip a couple times.",
      "Capitol, DCA-BWI, on a DC-3, my father’s best friends first flight as a captain, about 1957. Sat in the first row and they passed a wired headset back so we could hear the tower. He retired from UA, last routes Dulles to Honolulu, maybe only once or twice a month. Seniority rocks.\n\nEastern, of course, TWA riding on the ‘lead sleds’…",
      "We use to have an airline in Columbus called Skybus.  It followed the Ryan Air Model, but only lasted for like a year.  They had 19$ tickets to Seattle (ok, Bellingham).  They technically had their only hub in Cbus, but I don't think you could book connections.\n\nThe other great airline on Columbus was Skywest.  They had flights to Phoenix and merged with US Airways.  \n\nFor whatever reason Columbus could never get an airline to stick, although the flight options are starting to get pretty good.",
      "Peoples Express from NYC to DC to visit my older brother in college and party with his friends. I believe it was $19 and I paid in cash on board.",
      "MarkAir",
      "Piedmont, Mohawk, Air New England, PSA, Laker, Sempati, Merpati, Sabena…",
      "On the flip side, I’ve flown on the oldest airline still operating under its original name - KLM",
      "Viva Air (Colombia) and US Airways are the only ones I can think of that I've flown on.",
      "I remember flying Aloha Airlines back in the day.",
      "And those $200 trips to the Bahamas?",
      "Independence. On Independence, they had a video of safety stuff with Dennis Miller narrating.",
      "Reminds me of this Flyertalk thread. https://www.flyertalk.com/forum/travelbuzz/1282073-old-timer-s-airline-quiz-discussion.html",
      "🎶Allegheny! The big airline...with a hometown touch!🎶"
    ],
    "comments_lev2": [
      "When was this? You could just step on the plane and get a ticket once airborne, a bit like a train?",
      "We called it People's Depress.",
      "Yeah.  I used to fly it every now and then when I was in college to go home.  $20.  It was the original nickle and dime airline for me.  When all the big carriers still included a meal with domestic flights and checking luggage was free.  People express charged for everything, but just the flight was dirt cheap.",
      "Formerly Northwest Orient. We called it North Worst for good reason.",
      "I’d forgotten about Braniff!",
      "The first flight I took as a kid was on Midwest Express. Between the seats and the cookies, I was loving every minute of it!",
      "Midwest Express was awesome. Loved the smell of fresh baked cookies. And great prices for big biz class seats",
      "My first plane ride was to NYC on Midwest Express in 1990. I had breakfast service flying out and dinner service on the way back. Food was ***great***, seats were amazing. Absolutely lovely.",
      "My two all-time favorite airlines no longer exist: Midwest Express and Virgin America.",
      "No more Swissair? Really?",
      "Wow - I haven’t even heard of most of those.",
      "It was $19 for that trip the two times I took it.",
      "AirTran! That’s the one I was trying to remember. They augered one into the Florida swamp, I think.",
      "I remember flying Ansett in Australia now that you mention it.",
      "Where was that, and when?"
    ]
  },
  {
    "id": "1gyhcx6",
    "title": "Tips for Australia ",
    "text": "I’m planning a trip to Australia from January to March, starting from New England. I’m also considering visiting Hawaii and New Zealand during this time. I was wondering if anyone has tips or ideas to help make this trip more affordable. Specifically, I’d appreciate advice on the best websites to compare and book flight tickets, as well as any cost-saving strategies. For example, are there any countries I could fly to first that would make the flight to Australia cheaper? I’m open to any suggestions.",
    "comments_lev1": [
      "**Notice:** Are you asking for travel advice about Australia?\n\nRead what redditors had to say in the **[weekly destination thread for Australia](http://redd.it/2l9kcg)** \n\nYou may also be interested in this user created [Personal Guide to Australia](https://redd.it/6v2ahk). \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "BOS guy here - you are probably looking at a $1200+ flight RT. Sometimes you might see some options through Tahiti or Fiji which might make sense to try to do a stopover in. But it is pretty much 20+ hours from here to SYD\n\nThe cheapest one way BOS->SYD in Jan is on the 14th on a Delta+Air New Zealand codeshare routing, but they are not the cheapest in March - no obvious answers.  \n\nI am old, so I use matrix.itasoftware.com - you can do things like \"Starting Jan 1, across that month, show me the price of BOS->SYD RT trips lasting 60 days\"",
      "Depends where you plan on going in Australia. Flights from KUL-PER are reasonable if you use Air Asia. SIN-DRW was also reasonable. Both those options mean internal flights or travel depending on where you want to go, which when you add in the cost/hassle might make it a wash.   \n\nWe did a flight from HBA-AKL with Air New Zealand that was reasonable. Jet Star is cheaper but we've had issues with them in the past so prefer any other airline."
    ],
    "comments_lev2": []
  },
  {
    "id": "1gybs64",
    "title": "Day Trip to Montenegro or Bosnia and Herzegovina from Dubrovnik",
    "text": "I will be in Dubrovnik for a week and I saw that there are bus tour day trips available to Montenegro and Bosnia and Herzegovina. For Montenegro, the itinerary is to go to Our Lady of the Rocks at Perast, Kotor, and then the Bay of Kotor. For Bosnia and Herzegovina, the itinerary is to go to Herzegovina-Neretva Canton, Old Bridge, Mostar, and Kravica Waterfall.\n\n1. Is it worth it to go on these day trips?\n2. Would I be missing a lot if I didn't go to Montenegro or Bosnia and Herzegovina and stayed there for a few days?\n3. Since these countries are not part of the Schengen area, does it take a lot of time to do the actual border crossing by bus? ",
    "comments_lev1": [
      "I've been to most of those places. I'd pick the Bosnia option, Mostar is very unique and will give you a great example of the Ottoman influence.\n\n1) Yes because you said you'll be in Dubr. for a whole week, if it was just a few days I'd say stay put\n\n2) I really like Bosnia, so yes IMO\n\n3) I don't think so, tour operators have a lot of experience and run these tours hundreds of time/year",
      "**Notice:** Are you asking for travel advice about Bosnia?\n\nRead what redditors had to say in the **[weekly destination thread for Bosnia](https://redd.it/4zv8ti)**  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "We did a day trip into Mostar. Probably one of our favorite days in the Baltic. City is gorgeous, good food, nice shopping. Overall lovely day and would go back to stay longer.",
      "If you're in Dubrovnik for holiday only, I'd line up a few day trips or do a shorter stay in Dubrovnik.\n\nDubrovnik is good for a day or two, but not so much more there. And it's very crowded most of the year.",
      "I would do the day trips, though if you have the time, Bosnia is definitely worth it's own trip. Sarajevo is interesting and the people are lovely. It's not a wow city, it's a place to hang out in, soak up, and talk to people with lots of galleries and museums, especially about the war. Montenegro is best in summer, early fall or late spring. Perast is beautiful and I like old town Kotor and the nature around Kotor a lot, but I it's not a wow county I'd say EVERYone MUST go to.",
      "Honestly, my advice may not be the most helpful. However, I still want to state my opinion:)\n\nI would say travel to all three. Each country has a different culture and I feel as though not taking those day trips would be missing out on some amazing exploring. While they may be small countries and not explored very often, you can get to know locals if you really wanted to and try new foods potentially:) \n\nGood luck on your trip, stay safe✨"
    ],
    "comments_lev2": [
      "How about Montenegro? How did you like it? Is it worth to go as well?"
    ]
  },
  {
    "id": "1gyaozq",
    "title": "22 days Vietnam ",
    "text": "I hate to be one of those people but here I am. \n\nFirst time in Asia in general. Going to Vietnam with my husband for 22 days this march (not including flights to and from the US) \n\nPlanning to start a family after this so kind of anticipating this being our last big trip for a while.. \n\nHere’s my itinerary I would love to do, but seems a bit much. Should I give it a go and be tired or absolutely not you’re insane cut something out! If so what should we cut out. \nThings that are a must stay are ha giang loop, Hanoi, Hoi an, ninh bihn, cat ba island. \n\nHanoi 3 nights/2days \nHa Chiang loop 3 nights/4 days \nNinh Binh 3 nights/3 days \nCat ba island/lan ha bay 2 nights/ 3 full days \nPhong nha 1-2 nights 2 full days \nHue 1 night/2 days \nHoi an 3 nights 4 full days (day trips to da nang, ba na hills. \nDa lat 1 day \nHCM 1 day fly out (late) \n\nAlso nothing has been booked including airfare so I don’t even have to fly out of HCM necessarily. But I’d like to start in Hanoi to do the ha giang loop while I have energy and a semi decent back 😂 \n\nThanks so much. \n",
    "comments_lev1": [
      "I’d stay in Da Nang and day trip to Hoi An. 3 days in Hoi An would be a lot. I prefer large beaches and chillin FWIW",
      "Your formatting makes your schedule difficult to read but it looks like you have about 9 main locations + additional day trips + domestic travel in 22 days.\n\nYeah, that's a pile to fit in but if you're a fast traveller and you have the budget to bump up your domestic travel to include some private transport then anything is possible.\n\nGood luck and happy travels.\n\nPS Give yourself lots of time to [get the E-Visa.](https://evisa.xuatnhapcanh.gov.vn/trang-chu-ttdt) The application website is brand new and it's buggy as hell.",
      "That's wayyyyy too many places, the only memories you're going to have with the trip is of being on a vehicle and getting from place to place lol.",
      "Looks pretty good to me. I stayed in Da Nang for 3 days. A half day to visit My Son Sanctuary and a half day to visit Hoi An with the rest of the time spent exploring and chillin in Da Nang. That was good for me, because imho Hoi An has been killed by overtourism. It felt like 9 tourists for every one local. Touts and price gouging everywhere. I had seen lots of warnings on reddit about it, hence why I only planned a half day visit. Honestly, I could have skipped it all together and been happy, though no regrets. The scooter ride from Da Nang to Hoi An was fun and made the trip worthwhile. Just a heads up, you might wanna cut Hoi An or spend less time there. \n\nFor me Hue had great vibes and the best food. Cat ba was great and Phong Nha was awesome, especially paradise cave. I recommend riding scooters around both those places for fun. Surprisingly great food in Phong Nha too, the little bakery on the main strip had awesome baked goods and banh mi. \n\nHonestly, your pace doesn't sound too crazy to me. I did something similar, like 4 days in Hanoi, 2 days in Cat ba, 2 days in ninh binh, 2 days in phong nha, 3 days in Hue, 3 days in Da nang, 3 days in Saigon and it felt perfect. Not too rushed and for each place I felt like, yep, saw what I wanted to see, ready to move on.",
      "I've been to Vietnam a bunch and I like the Southern half a lot better, even if the North has more dramatic scenery. It's because I like food, and Hue South is my jam. \n\n\nFriggen love the delta area like Can Tho. Siagon destroys Hanoi for food, IMO. Don't cut out that day in Hue if you like to eat, see some ancient stuff and just eat around that day.  I'd personally cut a day from Hanoi and add a day to Saigon. Don't see sights except maybe the train station, just go to food markets. You can omit hue for da nang overnight if you want a beach and better seafood dishes (Da nang has a great Cham museum).  \n\n\n Also when you get a junk boat, I recommend 100% to get a top 3rd one for price. I've been on maybe 4 and for not a lot in Western pricing, you'll get a bettet experience. The cheap ones are usually filled not with locals but young banana pancake tourists shittered all the time. These are the ones that are willing to breathe in diesel fumes for days to take a boat from bali to Flores instead of a $110 plane and an hour.  \n\n\n I know, I was that person in my early 20's. If that's you go wild and get a party junk boat as you'll have stories. \n\n\nCut Da lat, it's not great and there's more Russians than Vietnamese. Add it to saigon or a day in the mekong going to a boat market or something. There are lots of university kids trying to make a buck and will show you around their family village and see floating markets for cheap. And it's just them  not a big tour company so it's open ended for itinerary. ",
      "Avoid Da Lat during Tet week. What a zoo!",
      "**Notice:** Are you asking for travel advice about Vietnam?\n\nRead what redditors had to say in the **[weekly destination thread for Vietnam](http://redd.it/2kknxb)** \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*"
    ],
    "comments_lev2": [
      "I know sorry it posted weird! \n\nYeah it’s feeling like a bit much to me the more I think on it. What one or two places would you cut out? \nNot into night life, or partying at all. Love culture, nature, food, and adventure .",
      "Okay I feel that. So I’m asking for advice- what would you cut out to make it more manageable? 🙏🏻",
      "Thank you this is actually really helpful. Thanks for your feedback!",
      "Tet is Jan. 25 to Feb. 2 this year. Even adding a week on each side for travel disruptions means it's meaningless for the OPer's trip in March."
    ]
  },
  {
    "id": "1gybwwe",
    "title": "Companies like Gate 1 Travel for Europeans?",
    "text": "Hey,  /r/travel! I'm an American, went for many Gate One tour travel deals over the last 10 years. Turkey, Italy, Spain, Croatia, Ireland ... Although I usually prefer to find my own way and go to \"off the beaten trail\" kind of places when I'm a certain area, sometimes it's nice to just let someone else do the driving. Plus the guided tours, the nice hotels, meals included, etc.\n\nAnd the best thing is the price.\n\nBut now I live in the Azores (Portugal) and I'm wanting to do these kinds of travel packages. But Gate 1 apparently prices everything for departures from (and arrivals back to) American hub cities (New York, usually, I think).\n\nMy question is, Are there any similar companies that offer tour packages with pricing for European departures? \n\nFor me, departures from Lisbon or Porto or Ponta Delgada would be ideal, but of course I can go to Paris or wherever to start a great trip.\n\nThanks, everyone!",
    "comments_lev1": [
      "You can just buy the land based package without the airfare. One Gate 1 trip we did there was a family and one of the sons lives in Singapore so he just booked the land based option and arranged his own flight. If something happens to your flight you are on your own though.",
      "We use Gate1 and never use their air services.",
      "We use Gate1 and never use their air services."
    ],
    "comments_lev2": []
  },
  {
    "id": "1gyitxb",
    "title": "germany packing help",
    "text": "Going on my first backpacking trip across Europe (netherlands, belgium, germany, austria) from dec - january. I am attempting to plan out my packing right now, as someone from a warm climate. Please let me know if this layering strategy is effective or what changes I should make.\n\n1 tight thermal layer (for really cold days) -> Long sleeve shirt -> fleece pullover (something like the north face denali 2)  -> REI 650 down jacket -> REI rainer rain jacket \n\nI would also have a scarf, beanie, and gloves. I will have pants with tights underneath if really needed.\n\nMy main concerns are with the rain jacket and pullover. I already purchased the 650 down jacket, and am aiming to save as much as possible. What options do yall recommend for a rain jacket and mid layer?",
    "comments_lev1": [
      "**Notice:** Are you asking for travel advice about Germany?\n\nRead what redditors had to say in the **[weekly destination thread for Germany](http://redd.it/2un357)**\n\nYou may also enjoy our topic: **[Germany off the tourist trail](https://redd.it/8k4pwa)**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*"
    ],
    "comments_lev2": []
  },
  {
    "id": "1gyekht",
    "title": "Solo Trip to Rome",
    "text": "I’m planning on doing a solo trip to Rome in June and I have a few questions I would like clarification on! I went to Germany in high school as an exchange trip (15 years ago), so the planning part of the trip is new to me. Thank you in advance!\n\n1. Is a week enough time to do Rome and potentially see Herculaneum or other parts of Italy?\n2. Is it better to use cash the entire time or can I use  my debit card like normal? How does that work with the exchange rate?\n3. What other things should I anticipate? I’m already adding an extra day for travel time to Rome so I get a full week there.\n",
    "comments_lev1": [
      "You probably want 4 full days to cover the highlights of Rome. Napoli is only a 45ish minute high speed train ride away. Herculaneum is probably a 20-30 minute commuter rail train ride from Napoli, Pompeii more like 50-60 minutes.\n\nYou might want to spend a couple nights in Napoli - you can do both MANN and Herculaneum in one day, while Pompeii is more of a full day",
      "Ciao! So, Rome has a lot to see and do but a week is a perfect amount of time, you can definitely go to Hercolanum, Villa Adriana, Ostia if you want. I wouldn't go to other Italian cities honestly, but if you really want you can take a Frecciarossa or Italo train to Naples, it's close.\n\nDebit card: sure, cards are accepted almost everywhere. But in some smaller bars or activities they may not accept cards for purchases below 10€. You can just withdraw some cash at a bank ATM with your debit card.\nWe can't know which card you have, so you should google your debit or credit card and check if it has a foreign currency fee, or ask your bank. Usually it's 3% unless you have a premium card. \n\nAnticipate a lot of people, this is the jubilee year and June will be a crowded month in Rome. Book everything you can in advance: hotels, museums, restaurants. Allow extra time for queues. On the other side, the city will probably be cleaner and tidier than usual!",
      "**Notice:** Are you asking for travel advice about Italy?\n\nRead what redditors had to say in the **[weekly destination thread for Italy](https://redd.it/304ym7)** \n\nYou may also enjoy our topic: **[Italy off the tourist trail](https://redd.it/8nigg3)**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "**Notice:** Are you asking for travel advice about Rome?\n\nRead what redditors had to say in the **[weekly destination thread for Rome](https://redd.it/7gnt36)**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*"
    ],
    "comments_lev2": [
      "What is MANN? And thank you!",
      "Okay perfect. The stuff I really want to see the most is the palatine hill and what that covers, Ostia antica, the domia severina and I think I heard about a trail in thr appian way?\n\nWhat exactly does the jubilee entail? I wouldn’t mind seeing the vatican but I know that will be busy."
    ]
  },
  {
    "id": "1gyidoh",
    "title": " Seeking Feedback on My Philippines Visa and Stay Extension Plans ",
    "text": "Hi everyone,\n\nI’m relocating to the Philippines on February 12, 2025, and I’d appreciate feedback on my plans for entering and staying in the country long-term. Here’s the breakdown of my approach:\n\n1. **Arrival and Initial Extension**:\n   * I’ll arrive for the initial 30-day stay.\n   * On the same day, I’ll apply the 59-day extension at the Bureau of Immigration (BI) office in NAIA,\n2. **Further Extensions and ACR-I Card**:\n   * One week before my 59-day stay expires, I’ll visit the BI office in Intramuros or another branch to extend for 6-months.\n3. **Long-Term Stays**:\n   * After the first 6-month extension, I’ll continue to renew my visa for another 6 months as needed.\n   * If I reach the 3-year limit for tourist visa extensions, I’ll plan a visa run to a nearby country (e.g., Singapore or Malaysia) and return to renew my visa.\n\nDoes this plan align with current procedures, and are there any recommendations or potential issues I should be aware of? Also, has anyone used **online extension options** so that I wouldn't have to be in-person for these extensions? Any insights or tips would be greatly appreciated!",
    "comments_lev1": [
      "**Notice:** Are you asking for travel advice about the Philippines?\n\nRead what redditors had to say in the **[weekly destination thread for the Philippines](http://redd.it/34y49d)**  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
      "Try\n\nr/philippines_expats"
    ],
    "comments_lev2": []
  },
  {
    "id": "1gyib1i",
    "title": "Baguio for the holidays",
    "text": "Hello. I just wanted to ask if you can recommend any place to visit/eat in baguio this christmas season? I’ve been there to baguio for a couple of times but wanted to try spending christmas season there just for once. Any recos please. Thanks a lot. ",
    "comments_lev1": [],
    "comments_lev2": []
  },
  {
    "id": "1gyhu9b",
    "title": "$1k+ AirBnb “Marijuana Smoke Wall Swab Test” Scam (Upheld)",
    "text": "I have been a digital nomad for over a decade so have used AirBnb 8 or 10 times over the years, normally for pretty lengthy stays. Last year the completely ruined a Europe trip for me with 3 of the 4 hosts screwing me over (all 3 still on the site fwiw.)\n\nThis recent scam is such a joke I thought it needed to be shared here. To be honest they asked for so much money at first I wasn’t even worried about it as it was so obvious. Silly me.\n\nWhile traveling to one of the islands in Thailand I booked a room right on the beach. I messaged the host first to ask a few questions, she instantly sends me a warning about no smoking in the room and I say no problem and book because I am not a smoker. The host sends me about a dozen other warning messages of things that aren’t allowed. No problems with any, but it did seem odd to be nailed with so many potential violations months in advance.\n\nI get to the place, it is a tiny (under 100 sq foot) apartment like you often find in Asia. As I look around I notice a lot of odd stuff, like there are 3 smoke detectors, the one that all the units have and then 2 they added. One is in the bathroom, the other is on the balcony. There are nearly a dozen no smoking signs, you can see half a dozen no matter where you stand in the place.\n\nWhy do we need 3 smoke detectors in the tiniest apartment I have ever seen? Who puts a smoke detector on a sea facing balcony where the constant sea breeze blows away any smoke instantly?\n\nI also notice I smell smoke when sitting in my room, I go look down and the guy below me is sitting on his balcony smoking. Odd for a building that has so many no smoking signs, but I barely smell it because of the obvious sea breeze.\n\nOn my second day I get a notice that if I smoke in the room again I will be evicted. I tell them I did not smoke, they send me some official building notice, and I start taking daily photos of the guy smoking below me in case they actually try to evict me.\n\nThis host is a pain in the ass to deal with throughout, they didn’t have everything the room needed but I eventually just quit asking them to bring it because I can tell they are nuts and I don’t want to deal with crazy people. I will spare you those details.\n\nSo my time ends, I check out, but I don’t leave a review because I can feel something coming and don’t want to look petty when I need to defend myself. And what a surprise, they claim I smoked in the unit, it took 7 days to clean (this tiny ass place), and it cost them well over a thousand dollars to clean it.\n\nI know AirBnb and their wonderful hosts have done their best to make absurd cleaning fees the norm, but for those that are unaware you can hire a live in maid for 3 to 4 months for that amount of money in Thailand. The place didn’t smell like smoke at all, the constant sea breeze made sure of that. And if it somehow did (it didn’t), it was clearly from the guy who smoked 10 times a day below me.\n\nI explain all of this to AirBnb, I upload the 20 photos of the guy smoking on different dates, and I assume this will be rejected in a day or two. In my mind they asked for such a ridiculous amount of money that they overplayed their hand and it could never go through.\n\nWell, I was kind of right. After I said I wouldn’t pay they talked it over again and said OK you only owe 2/3's. I (obviously) tell them that the scammers won’t be getting a penny from me.\n\nAt this time my card on file gets frozen because it was scammed somewhere else. The bank shuts the card down, so there is no payment method. But I have to pay for my next place on AirBnb and the deadline is coming.\n\nFor 3 weeks I try to use chat support, I try to call in through wifi via the website, I try the 1-800 numbers. Every time I am told I cannot call anyone in claims, they have to call me. I go out and buy a sim card and update my phone number, I start a chat with front line support confirming they have my current phone number. No phone call ever comes.\n\nThey close the case saying I owe nearly a grand. I tell them I will never add a payment method until this is lifted. And this is where it sits, I had to find a new place off AirBnb last minute and my next host got screwed because they can’t get anything resolved in a timely manner.\n\nAll along it was very clear they had no idea what was going on and had no intention of finding out. And it is no surprise they side with the property owner at the end.\n\nBased on what? Well, they have the word of the property owner. They have the word of the cleaning staff (so they say.) And they have a ‘marijuana smoke smell wall swab test.’\n\nYes, they claim the hosts used some swab that showed proof of marijuana smoke in the room. I try to point out a few obvious things here. The first being WTF are you talking about? The second being, even if somehow this is legit (it ain’t), it doesn’t prove when it was smoked, where it was smoked, who smoked it, or that I had anything to do with it.\n\nMy 20 photos of the guy right below me smoking on different dates mean nothing. My history of having stayed in AirBnb’s for probably close to a year with no one ever claiming I left a room smelling like smoke or mentioning smoke at all are meaningless. The property owner says it is so so it is so. Oh ya, and the ‘marijuana smoke smell wall swab test.’\n\n AirBnb has turned into the modern Craigslist. It is a cesspool that has attracted more scammers than anywhere. It has been the biggest causer of stress in my life over the past 2 years since I started using it more frequently. None of the shitty hosts from the past who AirBnb has been told have screwed me over (and they can often see their lies right there in the chat) have been removed from the site. Only my reviews exposing them have.\n\nMy advice, don’t use any kind of payment method you want to keep long term on AirBnb. Be ready to close that account when a scam comes. At least the banks and credit card companies have had to deal with this crap so often they know it is coming and will usually have your back.\n\nTake pictures and videos of everything when you check in. And if something doesn't smell right mention it to AirBnb ahead of time. If you wait til after the fact the property owner is the only opinion they care about.",
    "comments_lev1": [
      "I am also a long term nomad, and I can't work out for the life of me why you would ever use AirBnB in the first place, especially in Asia. I often compare listings to Booking and Agoda, and not once have I found a better deal on AirBnB. It's always more expensive, the terms are always more restrictive, the added fees are more confusing and it's always more difficult getting people to respond to enquiries. On top of that, AirBnb has completely fucked up rental markets across the world. Boycott this shitty company.",
      "Thought this was the airbnb subreddit at first. Yeah ive had two major issues with Airbnb’s and had a place try to blame me for existing mold in their place and change me $300",
      "This reminds me of my nightmare with non-existent Uber support. I usually use Agoda in SEA. But I don't do long term stays."
    ],
    "comments_lev2": []
  }
]